; ModuleID = 'codon'
source_filename = "/Users/rgt/Desktop/BITS/TurboX/tests/test_framework_integration.codon"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-darwin24.6.0"

@..argv = private global { i64, ptr } zeroinitializer, !dbg !0
@".%_import_algorithms_heapsort_51.0" = private global { i8 } zeroinitializer, !dbg !5
@".%_import_algorithms_insertionsort_50.0" = private global { i8 } zeroinitializer, !dbg !13
@".%_import_algorithms_pdqsort_49.0" = private global { i8 } zeroinitializer, !dbg !18
@".%_import_algorithms_qsort_52.0" = private global { i8 } zeroinitializer, !dbg !24
@".%_import_algorithms_strings_46.0" = private global { i8 } zeroinitializer, !dbg !29
@".%_import_algorithms_timsort_53.0" = private global { i8 } zeroinitializer, !dbg !35
@".%_import_conduit___init___86.0" = private global { i8 } zeroinitializer, !dbg !40
@".%_import_conduit_framework_conduit_87.0" = private global { i8 } zeroinitializer, !dbg !45
@".%_import_conduit_http_request_89.0" = private global { i8 } zeroinitializer, !dbg !51
@".%_import_conduit_http_response_90.0" = private global { i8 } zeroinitializer, !dbg !57
@".%_import_conduit_http_router_91.0" = private global { i8 } zeroinitializer, !dbg !62
@".%_import_conduit_net_socket_88.0" = private global { i8 } zeroinitializer, !dbg !67
@".%_import_gpu_55.0" = private global { i8 } zeroinitializer, !dbg !72

!239 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !237, file: !9, line: 291, baseType: !12, size: 8)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "%_import_openmp_54", linkageName: "%_import_openmp_54.0", scope: !2, file: !74, line: 42, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/openmp.codon','openmp']", scope: !9, file: !9, line: 290, size: 8, elements: !243)
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !242, file: !9, line: 291, baseType: !12, size: 8)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "%_import_os___init___82", linkageName: "%_import_os___init___82.0", scope: !2, file: !247, line: 3, type: !248, isLocal: true, isDefinition: true)
!247 = !DIFile(filename: "python.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/os/__init__.codon','os.__init__']", scope: !9, file: !9, line: 290, size: 8, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !248, file: !9, line: 291, baseType: !12, size: 8)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "%_import_pickle_69", linkageName: "%_import_pickle_69.0", scope: !2, file: !74, line: 45, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/pickle.codon','pickle']", scope: !9, file: !9, line: 290, size: 8, elements: !254)
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !253, file: !9, line: 291, baseType: !12, size: 8)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: ".default.NamedTuple.__new__:0.args", linkageName: ".default.NamedTuple.__new__:0.args", scope: !2, file: !9, line: 354, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple", scope: !9, file: !9, line: 153, elements: !259)
!259 = !{}
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: ".default.NamedTuple.get:0.default", linkageName: ".default.NamedTuple.get:0.default", scope: !2, file: !9, line: 364, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoneType", scope: !9, file: !9, line: 100, elements: !259)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: ".default.std.internal.builtin.print.0:0.file", linkageName: ".default.std.internal.builtin.print.0:0.file", scope: !2, file: !265, line: 18, type: !266, isLocal: true, isDefinition: true)
!265 = !DIFile(filename: "builtin.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIBasicType(name: "byte", size: 8, encoding: DW_ATE_signed_char)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: ".default.std.internal.dlopen.dlopen.1:0.flag", linkageName: ".default.std.internal.dlopen.dlopen.1:0.flag", scope: !2, file: !270, line: 23, type: !271, isLocal: true, isDefinition: true)
!270 = !DIFile(filename: "dlopen.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!271 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: ".default.std.internal.file.File.0.read:0.sz", linkageName: ".default.std.internal.file.File.0.read:0.sz", scope: !2, file: !274, line: 53, type: !271, isLocal: true, isDefinition: true)
!274 = !DIFile(filename: "file.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: ".default.std.internal.file.bzFile.0.read:0.sz", linkageName: ".default.std.internal.file.bzFile.0.read:0.sz", scope: !2, file: !274, line: 334, type: !271, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: ".default.std.internal.file.gzFile.0.read:0.sz", linkageName: ".default.std.internal.file.gzFile.0.read:0.sz", scope: !2, file: !274, line: 197, type: !271, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: ".default.std.internal.python._PyWrapError.0.__init__:5.pytype", linkageName: ".default.std.internal.python._PyWrapError.0.__init__:5.pytype", scope: !2, file: !247, line: 1540, type: !281, isLocal: true, isDefinition: true)
!281 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !282)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !283, file: !283, size: 64, elements: !284)
!283 = !DIFile(filename: "", directory: ".")
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !282, file: !9, line: 142, baseType: !266, size: 64)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: ".default.std.internal.sort.sorted.0:0.key", linkageName: ".default.std.internal.sort.sorted.0:0.key", scope: !2, file: !20, line: 9, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Optional[int]", scope: !9, file: !9, line: 125, size: 128, elements: !289)
!289 = !{!290, !292}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !288, file: !9, line: 125, baseType: !291, size: 8)
!291 = !DIBasicType(name: "i1", size: 8, encoding: DW_ATE_boolean)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !288, file: !9, line: 125, baseType: !271, size: 64, offset: 64)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: ".default.std.internal.types.array.List.0.pop:0.idx", linkageName: ".default.std.internal.types.array.List.0.pop:0.idx", scope: !2, file: !295, line: 318, type: !271, isLocal: true, isDefinition: true)
!295 = !DIFile(filename: "list.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections")
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: ".default.std.internal.types.array.List.0.sort:0.key", linkageName: ".default.std.internal.types.array.List.0.sort:0.key", scope: !2, file: !20, line: 62, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Optional[int]", scope: !9, file: !9, line: 125, size: 128, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !298, file: !9, line: 125, baseType: !291, size: 8)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !298, file: !9, line: 125, baseType: !271, size: 64, offset: 64)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: ".default.std.openmp.for_par.0:0.chunk_size", linkageName: ".default.std.openmp.for_par.0:0.chunk_size", scope: !2, file: !304, line: 888, type: !271, isLocal: true, isDefinition: true)
!304 = !DIFile(filename: "openmp.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib")
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: ".default.std.openmp.for_par.0:0.num_threads", linkageName: ".default.std.openmp.for_par.0:0.num_threads", scope: !2, file: !304, line: 888, type: !271, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: ".default.str.replace:0.maxcount", linkageName: ".default.str.replace:0.maxcount", scope: !2, file: !31, line: 726, type: !271, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: ".default.str.rsplit:0.maxsplit", linkageName: ".default.str.rsplit:0.maxsplit", scope: !2, file: !31, line: 598, type: !271, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: ".default.str.split:0.maxsplit", linkageName: ".default.str.split:0.maxsplit", scope: !2, file: !31, line: 564, type: !271, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "AF_INET", linkageName: "AF_INET.0", scope: !2, file: !315, line: 30, type: !271, isLocal: true, isDefinition: true)
!315 = !DIFile(filename: "socket.codon", directory: "/Users/rgt/Desktop/BITS/TurboX/conduit/net")
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "Py_IncRef", linkageName: "Py_IncRef.0", scope: !2, file: !247, line: 11, type: !318, isLocal: true, isDefinition: true)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!262, !266}
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "SOCK_STREAM", linkageName: "SOCK_STREAM.0", scope: !2, file: !315, line: 31, type: !271, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "_DEFAULT_IDENT", linkageName: "_DEFAULT_IDENT.0", scope: !2, file: !304, line: 97, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !304, file: !304, line: 46, size: 192, elements: !326)
!326 = !{!327, !329, !330, !331, !332}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !325, file: !304, line: 47, baseType: !328, size: 32)
!328 = !DIBasicType(name: "Int32", size: 32, encoding: DW_ATE_signed)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !325, file: !304, line: 48, baseType: !328, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !325, file: !304, line: 49, baseType: !328, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !325, file: !304, line: 50, baseType: !328, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !325, file: !304, line: 51, baseType: !266, size: 64, offset: 128)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "_IS_MACOS", linkageName: "_IS_MACOS.0", scope: !2, file: !315, line: 36, type: !12, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "_KMP_IDENT_KMPC", linkageName: "_KMP_IDENT_KMPC.0", scope: !2, file: !304, line: 10, type: !271, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "_MAX", linkageName: "_MAX.0", scope: !2, file: !31, line: 3, type: !271, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "_REDUCTION_IDENT", linkageName: "_REDUCTION_IDENT.0", scope: !2, file: !304, line: 99, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !304, file: !304, line: 46, size: 192, elements: !342)
!342 = !{!343, !344, !345, !346, !347}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !341, file: !304, line: 47, baseType: !328, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !341, file: !304, line: 48, baseType: !328, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !341, file: !304, line: 49, baseType: !328, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !341, file: !304, line: 50, baseType: !328, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !341, file: !304, line: 51, baseType: !266, size: 64, offset: 128)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "_STATIC_LOOP_IDENT", linkageName: "_STATIC_LOOP_IDENT.0", scope: !2, file: !304, line: 98, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !304, file: !304, line: 46, size: 192, elements: !351)
!351 = !{!352, !353, !354, !355, !356}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !350, file: !304, line: 47, baseType: !328, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !350, file: !304, line: 48, baseType: !328, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !350, file: !304, line: 49, baseType: !328, size: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !350, file: !304, line: 50, baseType: !328, size: 32, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !350, file: !304, line: 51, baseType: !266, size: 64, offset: 128)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "__apple__", linkageName: "__apple__.0", scope: !2, file: !283, type: !271, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "__vtable_size__", linkageName: "__vtable_size__.0", scope: !2, file: !361, line: 11, type: !271, isLocal: true, isDefinition: true)
!361 = !DIFile(filename: "internal.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "__vtables__", linkageName: "__vtables__.0", scope: !2, file: !361, line: 10, type: !364, isLocal: true, isDefinition: true)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "bfloat16", linkageName: "bfloat16.MIN_10_EXP", scope: !2, file: !9, line: 76, type: !271, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "block", linkageName: "block.0", scope: !2, file: !370, line: 217, type: !371, isLocal: true, isDefinition: true)
!370 = !DIFile(filename: "gpu.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib")
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Block.0", scope: !370, file: !370, line: 118, elements: !259)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "float", linkageName: "float.MIN_10_EXP", scope: !2, file: !9, line: 55, type: !271, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "float128", linkageName: "float128.MIN_10_EXP", scope: !2, file: !9, line: 83, type: !271, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "float16", linkageName: "float16.MIN_10_EXP", scope: !2, file: !9, line: 69, type: !271, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "float32", linkageName: "float32.MIN_10_EXP", scope: !2, file: !9, line: 62, type: !271, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "grid", linkageName: "grid.0", scope: !2, file: !370, line: 218, type: !382, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Grid.0", scope: !370, file: !370, line: 178, elements: !259)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "int", linkageName: "int.MAX", scope: !2, file: !9, line: 48, type: !271, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.ArithmeticError.0._pytype", scope: !2, file: !387, line: 100, type: !266, isLocal: true, isDefinition: true)
!387 = !DIFile(filename: "error.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types")
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.AssertionError.0._pytype", scope: !2, file: !387, line: 148, type: !266, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.AttributeError.0._pytype", scope: !2, file: !387, line: 121, type: !266, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.BaseException.0._pytype", scope: !2, file: !387, line: 5, type: !266, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.CError.0._pytype", scope: !2, file: !387, line: 88, type: !266, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.EOFError.0._pytype", scope: !2, file: !387, line: 154, type: !266, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.Exception.0._pytype", scope: !2, file: !387, line: 36, type: !266, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.IOError.0._pytype", scope: !2, file: !387, line: 55, type: !266, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.IndexError.0._pytype", scope: !2, file: !387, line: 76, type: !266, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.KeyError.0._pytype", scope: !2, file: !387, line: 82, type: !266, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.LookupError.0._pytype", scope: !2, file: !387, line: 67, type: !266, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.NameError.0._pytype", scope: !2, file: !387, line: 43, type: !266, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.NotImplementedError.0._pytype", scope: !2, file: !387, line: 136, type: !266, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.OSError.0._pytype", scope: !2, file: !387, line: 49, type: !266, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.OverflowError.0._pytype", scope: !2, file: !387, line: 115, type: !266, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.RuntimeError.0._pytype", scope: !2, file: !387, line: 127, type: !266, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.StopIteration.0._pytype", scope: !2, file: !387, line: 142, type: !266, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.SystemExit.0._pytype", scope: !2, file: !387, line: 160, type: !266, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.TypeError.0._pytype", scope: !2, file: !387, line: 94, type: !266, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.ValueError.0._pytype", scope: !2, file: !387, line: 61, type: !266, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.ZeroDivisionError.0._pytype", scope: !2, file: !387, line: 106, type: !266, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "thread", linkageName: "thread.0", scope: !2, file: !370, line: 216, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Thread.0", scope: !370, file: !370, line: 83, elements: !259)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "warp", linkageName: "warp.0", scope: !2, file: !370, line: 219, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Warp.0", scope: !370, file: !370, line: 205, elements: !259)
!434 = !DIFile(filename: "<internal>", directory: ".")
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: ".Array[str]", scope: !283, file: !283, size: 128, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !435, file: !283, baseType: !271, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !435, file: !283, baseType: !439, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !440, file: !9, line: 146, baseType: !271, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !440, file: !9, line: 146, baseType: !266, size: 64, offset: 64)
!444 = !{i32 2, !"Debug Info Version", i32 3}
!445 = !{i32 2, !"Dwarf Version", i32 2}
!446 = distinct !DISubprogram(name: "derives", linkageName: "derives:0.2", scope: !9, file: !9, line: 213, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!447 = !DISubroutineType(types: !448)
!448 = !{!262}
!449 = !DILocation(line: 213, column: 1, scope: !446)
!450 = distinct !DISubprogram(name: "pure", linkageName: "pure:0.3", scope: !9, file: !9, line: 209, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!451 = !DILocation(line: 209, column: 1, scope: !450)
!452 = distinct !DISubprogram(name: "ellipsis.__new__", linkageName: "ellipsis.__new__:0.4", scope: !9, file: !9, line: 277, type: !453, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!453 = !DISubroutineType(types: !454)
!454 = !{!455}
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "ellipsis", scope: !9, file: !9, line: 273, elements: !259)
!456 = !DILocation(line: 277, column: 5, scope: !452)
!457 = distinct !DISubprogram(name: "Tuple.__new__", linkageName: "Tuple.__new__:0.5", scope: !9, file: !9, line: 155, type: !458, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!458 = !DISubroutineType(types: !459)
!459 = !{!258}
!460 = !DILocation(line: 155, column: 5, scope: !457)
!461 = distinct !DISubprogram(name: "NoneType.__new__", linkageName: "NoneType.__new__:0.6", scope: !9, file: !9, line: 221, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!462 = !DILocation(line: 221, column: 5, scope: !461)
!463 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/attributes.codon','internal.attributes'].7", scope: !9, file: !9, line: 298, type: !464, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!464 = !DISubroutineType(types: !465)
!465 = !{!466, !12}
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/attributes.codon','internal.attributes']", scope: !9, file: !9, line: 290, size: 8, elements: !467)
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !466, file: !9, line: 291, baseType: !12, size: 8)
!469 = !DILocation(line: 298, column: 5, scope: !463)
!470 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/static.codon','internal.static'].9", scope: !9, file: !9, line: 298, type: !471, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!471 = !DISubroutineType(types: !472)
!472 = !{!473, !12}
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/static.codon','internal.static']", scope: !9, file: !9, line: 290, size: 8, elements: !474)
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !473, file: !9, line: 291, baseType: !12, size: 8)
!476 = !DILocation(line: 298, column: 5, scope: !470)
!477 = distinct !DISubprogram(name: "no_argument_wrap", linkageName: "std.internal.attributes.no_argument_wrap.0:0.11", scope: !478, file: !478, line: 60, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!478 = !DIFile(filename: "attributes.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!479 = !DILocation(line: 60, column: 1, scope: !477)
!480 = distinct !DISubprogram(name: "overload", linkageName: "overload:0.12", scope: !9, file: !9, line: 318, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!481 = !DILocation(line: 318, column: 1, scope: !480)
!482 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/ptr.codon','internal.types.ptr'].13", scope: !9, file: !9, line: 298, type: !483, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !12}
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/ptr.codon','internal.types.ptr']", scope: !9, file: !9, line: 290, size: 8, elements: !486)
!486 = !{!487}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !485, file: !9, line: 291, baseType: !12, size: 8)
!488 = !DILocation(line: 298, column: 5, scope: !482)
!489 = distinct !DISubprogram(name: "self_captures", linkageName: "std.internal.attributes.self_captures.0:0.15", scope: !478, file: !478, line: 36, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!490 = !DILocation(line: 36, column: 1, scope: !489)
!491 = distinct !DISubprogram(name: "nocapture", linkageName: "std.internal.attributes.nocapture.0:0.16", scope: !478, file: !478, line: 28, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!492 = !DILocation(line: 28, column: 1, scope: !491)
!493 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/str.codon','internal.types.str'].17", scope: !9, file: !9, line: 298, type: !494, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!494 = !DISubroutineType(types: !495)
!495 = !{!496, !12}
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/str.codon','internal.types.str']", scope: !9, file: !9, line: 290, size: 8, elements: !497)
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !496, file: !9, line: 291, baseType: !12, size: 8)
!499 = !DILocation(line: 298, column: 5, scope: !493)
!500 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/int.codon','internal.types.int'].19", scope: !9, file: !9, line: 298, type: !501, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!501 = !DISubroutineType(types: !502)
!502 = !{!503, !12}
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/int.codon','internal.types.int']", scope: !9, file: !9, line: 290, size: 8, elements: !504)
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !503, file: !9, line: 291, baseType: !12, size: 8)
!506 = !DILocation(line: 298, column: 5, scope: !500)
!507 = distinct !DISubprogram(name: "associative", linkageName: "std.internal.attributes.associative.0:0.21", scope: !478, file: !478, line: 44, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!508 = !DILocation(line: 44, column: 1, scope: !507)
!509 = distinct !DISubprogram(name: "commutative", linkageName: "std.internal.attributes.commutative.0:0.22", scope: !478, file: !478, line: 40, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!510 = !DILocation(line: 40, column: 1, scope: !509)
!511 = distinct !DISubprogram(name: "distributive", linkageName: "std.internal.attributes.distributive.0:0.23", scope: !478, file: !478, line: 48, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!512 = !DILocation(line: 48, column: 1, scope: !511)
!513 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/bool.codon','internal.types.bool'].24", scope: !9, file: !9, line: 298, type: !514, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!514 = !DISubroutineType(types: !515)
!515 = !{!516, !12}
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/bool.codon','internal.types.bool']", scope: !9, file: !9, line: 290, size: 8, elements: !517)
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !516, file: !9, line: 291, baseType: !12, size: 8)
!519 = !DILocation(line: 298, column: 5, scope: !513)
!520 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/array.codon','internal.types.array'].26", scope: !9, file: !9, line: 298, type: !521, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!521 = !DISubroutineType(types: !522)
!522 = !{!523, !12}
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/array.codon','internal.types.array']", scope: !9, file: !9, line: 290, size: 8, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !523, file: !9, line: 291, baseType: !12, size: 8)
!526 = !DILocation(line: 298, column: 5, scope: !520)
!527 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/gc.codon','internal.gc'].28", scope: !9, file: !9, line: 298, type: !528, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!528 = !DISubroutineType(types: !529)
!529 = !{!530, !12}
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/gc.codon','internal.gc']", scope: !9, file: !9, line: 290, size: 8, elements: !531)
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !530, file: !9, line: 291, baseType: !12, size: 8)
!533 = !DILocation(line: 298, column: 5, scope: !527)
!534 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/error.codon','internal.types.error'].30", scope: !9, file: !9, line: 298, type: !535, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!535 = !DISubroutineType(types: !536)
!536 = !{!537, !12}
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/error.codon','internal.types.error']", scope: !9, file: !9, line: 290, size: 8, elements: !538)
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !537, file: !9, line: 291, baseType: !12, size: 8)
!540 = !DILocation(line: 298, column: 5, scope: !534)
!541 = distinct !DISubprogram(name: "Pointer[byte].__new__", linkageName: "Ptr[byte]:Ptr.__new__:0.32", scope: !542, file: !542, line: 7, type: !543, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!542 = !DIFile(filename: "ptr.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types")
!543 = !DISubroutineType(types: !544)
!544 = !{!266}
!545 = !DILocation(line: 7, column: 5, scope: !541)
!546 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/intn.codon','internal.types.intn'].33", scope: !9, file: !9, line: 298, type: !547, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!547 = !DISubroutineType(types: !548)
!548 = !{!549, !12}
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/intn.codon','internal.types.intn']", scope: !9, file: !9, line: 290, size: 8, elements: !550)
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !549, file: !9, line: 291, baseType: !12, size: 8)
!552 = !DILocation(line: 298, column: 5, scope: !546)
!553 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/float.codon','internal.types.float'].35", scope: !9, file: !9, line: 298, type: !554, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!554 = !DISubroutineType(types: !555)
!555 = !{!556, !12}
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/float.codon','internal.types.float']", scope: !9, file: !9, line: 290, size: 8, elements: !557)
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !556, file: !9, line: 291, baseType: !12, size: 8)
!559 = !DILocation(line: 298, column: 5, scope: !553)
!560 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/byte.codon','internal.types.byte'].37", scope: !9, file: !9, line: 298, type: !561, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !12}
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/byte.codon','internal.types.byte']", scope: !9, file: !9, line: 290, size: 8, elements: !564)
!564 = !{!565}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !563, file: !9, line: 291, baseType: !12, size: 8)
!566 = !DILocation(line: 298, column: 5, scope: !560)
!567 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/generator.codon','internal.types.generator'].39", scope: !9, file: !9, line: 298, type: !568, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!568 = !DISubroutineType(types: !569)
!569 = !{!570, !12}
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/generator.codon','internal.types.generator']", scope: !9, file: !9, line: 290, size: 8, elements: !571)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !570, file: !9, line: 291, baseType: !12, size: 8)
!573 = !DILocation(line: 298, column: 5, scope: !567)
!574 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/optional.codon','internal.types.optional'].41", scope: !9, file: !9, line: 298, type: !575, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!575 = !DISubroutineType(types: !576)
!576 = !{!577, !12}
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/optional.codon','internal.types.optional']", scope: !9, file: !9, line: 290, size: 8, elements: !578)
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !577, file: !9, line: 291, baseType: !12, size: 8)
!580 = !DILocation(line: 298, column: 5, scope: !574)
!581 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/c_stubs.codon','internal.c_stubs'].43", scope: !9, file: !9, line: 298, type: !582, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!582 = !DISubroutineType(types: !583)
!583 = !{!584, !12}
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/c_stubs.codon','internal.c_stubs']", scope: !9, file: !9, line: 290, size: 8, elements: !585)
!585 = !{!586}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !584, file: !9, line: 291, baseType: !12, size: 8)
!587 = !DILocation(line: 298, column: 5, scope: !581)
!588 = distinct !DISubprogram(name: "no_side_effect", linkageName: "std.internal.attributes.no_side_effect.0:0.45", scope: !478, file: !478, line: 24, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!589 = !DILocation(line: 24, column: 1, scope: !588)
!590 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/format.codon','internal.format'].46", scope: !9, file: !9, line: 298, type: !591, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!591 = !DISubroutineType(types: !592)
!592 = !{!593, !12}
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/format.codon','internal.format']", scope: !9, file: !9, line: 290, size: 8, elements: !594)
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !593, file: !9, line: 291, baseType: !12, size: 8)
!596 = !DILocation(line: 298, column: 5, scope: !590)
!597 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/internal.codon','internal.internal'].48", scope: !9, file: !9, line: 298, type: !598, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!598 = !DISubroutineType(types: !599)
!599 = !{!600, !12}
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/internal.codon','internal.internal']", scope: !9, file: !9, line: 290, size: 8, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !600, file: !9, line: 291, baseType: !12, size: 8)
!603 = !DILocation(line: 298, column: 5, scope: !597)
!604 = distinct !DISubprogram(name: "Pointer[Pointer[Pointer[byte]]].__new__", linkageName: "Ptr[Ptr[Ptr[byte]]]:Ptr.__new__:0.50", scope: !542, file: !542, line: 7, type: !605, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!605 = !DISubroutineType(types: !606)
!606 = !{!364}
!607 = !DILocation(line: 7, column: 5, scope: !604)
!608 = distinct !DISubprogram(name: "inline", linkageName: "std.internal.attributes.inline.0:0.51", scope: !478, file: !478, line: 12, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!609 = !DILocation(line: 12, column: 1, scope: !608)
!610 = distinct !DISubprogram(name: "int.__add__", linkageName: "int:int.__add__:2[int,int].52", scope: !611, file: !611, line: 103, type: !612, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!611 = !DIFile(filename: "int.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types")
!612 = !DISubroutineType(types: !613)
!613 = !{!271, !271, !271}
!614 = !DILocation(line: 103, column: 5, scope: !610)
!615 = distinct !DISubprogram(name: "alloc_atomic_uncollectable", linkageName: "std.internal.gc.alloc_atomic_uncollectable.0:0[int].57", scope: !616, file: !616, line: 81, type: !617, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !619)
!616 = !DIFile(filename: "gc.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!617 = !DISubroutineType(types: !618)
!618 = !{!266, !271}
!619 = !{!620}
!620 = !DILocalVariable(name: "sz", arg: 1, scope: !615, file: !283, type: !271)
!621 = !DILocation(line: 81, column: 1, scope: !615)
!622 = !DILocation(line: 0, scope: !615)
!623 = !DILocation(line: 82, column: 43, scope: !615)
!624 = distinct !DISubprogram(name: "sizeof", linkageName: "std.internal.gc.sizeof.0:0[,Ptr[Ptr[byte]]].59", scope: !616, file: !616, line: 59, type: !625, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!625 = !DISubroutineType(types: !626)
!626 = !{!271}
!627 = !DILocation(line: 59, column: 1, scope: !624)
!628 = !DILocation(line: 60, column: 12, scope: !624)
!629 = distinct !DISubprogram(name: "int.__mul__", linkageName: "int:int.__mul__:1[int,int].60", scope: !611, file: !611, line: 135, type: !612, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!630 = !DILocation(line: 135, column: 5, scope: !629)
!631 = distinct !DISubprogram(name: "Pointer[Pointer[Pointer[byte]]].__new__", linkageName: "Ptr[Ptr[Ptr[byte]]]:Ptr.__new__:3[Ptr[byte]].63", scope: !542, file: !542, line: 26, type: !632, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!632 = !DISubroutineType(types: !633)
!633 = !{!364, !266}
!634 = !DILocation(line: 26, column: 5, scope: !631)
!635 = distinct !DISubprogram(name: "__internal__.class_populate_vtables", linkageName: "__internal__.class_populate_vtables:0.65", scope: !361, file: !361, line: 75, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!636 = !DILocation(line: 75, column: 5, scope: !635)
!637 = distinct !DISubprogram(name: "__internal__.class_init_vtables", linkageName: "__internal__.class_init_vtables:0.66", scope: !361, file: !361, line: 58, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !638)
!638 = !{!639, !640}
!639 = !DILocalVariable(name: "sz", scope: !637, file: !361, line: 63, type: !271)
!640 = !DILocalVariable(name: "p", scope: !637, file: !361, line: 64, type: !266)
!641 = !DILocation(line: 58, column: 5, scope: !637)
!642 = !DILocation(line: 63, column: 9, scope: !637)
!643 = !DILocation(line: 64, column: 9, scope: !637)
!644 = !DILocation(line: 63, column: 32, scope: !637)
!645 = !DILocation(line: 64, column: 40, scope: !637)
!646 = !DILocation(line: 64, column: 45, scope: !637)
!647 = !DILocation(line: 65, column: 38, scope: !637)
!648 = !DILocation(line: 66, column: 9, scope: !637)
!649 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/slice.codon','internal.types.slice'].67", scope: !9, file: !9, line: 298, type: !650, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!650 = !DISubroutineType(types: !651)
!651 = !{!652, !12}
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/slice.codon','internal.types.slice']", scope: !9, file: !9, line: 290, size: 8, elements: !653)
!653 = !{!654}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !652, file: !9, line: 291, baseType: !12, size: 8)
!655 = !DILocation(line: 298, column: 5, scope: !649)
!656 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/range.codon','internal.types.range'].459", scope: !9, file: !9, line: 298, type: !657, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!657 = !DISubroutineType(types: !658)
!658 = !{!659, !12}
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/range.codon','internal.types.range']", scope: !9, file: !9, line: 290, size: 8, elements: !660)
!660 = !{!661}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !659, file: !9, line: 291, baseType: !12, size: 8)
!662 = !DILocation(line: 298, column: 5, scope: !656)
!663 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/complex.codon','internal.types.complex'].461", scope: !9, file: !9, line: 298, type: !664, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!664 = !DISubroutineType(types: !665)
!665 = !{!666, !12}
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/complex.codon','internal.types.complex']", scope: !9, file: !9, line: 290, size: 8, elements: !667)
!667 = !{!668}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !666, file: !9, line: 291, baseType: !12, size: 8)
!669 = !DILocation(line: 298, column: 5, scope: !663)
!670 = distinct !DISubprogram(name: "Pointer[str].__new__", linkageName: "Ptr.__new__:1.463", scope: !542, file: !542, line: 12, type: !671, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!671 = !DISubroutineType(types: !672)
!672 = !{!673, !271}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !674, file: !9, line: 146, baseType: !271, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !674, file: !9, line: 146, baseType: !266, size: 64, offset: 64)
!678 = !DILocation(line: 12, column: 5, scope: !670)
!679 = distinct !DISubprogram(name: "Array[str].__new__", linkageName: "Array[str]:Array.__new__:0[Ptr[str],int].465", scope: !110, file: !110, line: 10, type: !680, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!680 = !DISubroutineType(types: !681)
!681 = !{!682, !686, !271}
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "Array[str]", scope: !110, file: !110, line: 53, size: 128, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !682, file: !9, line: 227, baseType: !271, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !682, file: !9, line: 228, baseType: !686, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !687, file: !9, line: 146, baseType: !271, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !687, file: !9, line: 146, baseType: !266, size: 64, offset: 64)
!691 = !DILocation(line: 10, column: 5, scope: !679)
!692 = distinct !DISubprogram(name: "Array[str].__new__", linkageName: "Array[str]:Array.__new__:1[int].468", scope: !110, file: !110, line: 16, type: !693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !704)
!693 = !DISubroutineType(types: !694)
!694 = !{!695, !271}
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "Array[str]", scope: !110, file: !110, line: 53, size: 128, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !695, file: !9, line: 227, baseType: !271, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !695, file: !9, line: 228, baseType: !699, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !700, file: !9, line: 146, baseType: !271, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !700, file: !9, line: 146, baseType: !266, size: 64, offset: 64)
!704 = !{!705}
!705 = !DILocalVariable(name: "sz", arg: 1, scope: !692, file: !283, type: !271)
!706 = !DILocation(line: 16, column: 5, scope: !692)
!707 = !DILocation(line: 0, scope: !692)
!708 = !DILocation(line: 17, column: 32, scope: !692)
!709 = !DILocation(line: 17, column: 37, scope: !692)
!710 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/strbuf.codon','internal.types.strbuf'].470", scope: !9, file: !9, line: 298, type: !711, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!711 = !DISubroutineType(types: !712)
!712 = !{!713, !12}
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/strbuf.codon','internal.types.strbuf']", scope: !9, file: !9, line: 290, size: 8, elements: !714)
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !713, file: !9, line: 291, baseType: !12, size: 8)
!716 = !DILocation(line: 298, column: 5, scope: !710)
!717 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/list.codon','internal.types.collections.list'].472", scope: !9, file: !9, line: 298, type: !718, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!718 = !DISubroutineType(types: !719)
!719 = !{!720, !12}
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/list.codon','internal.types.collections.list']", scope: !9, file: !9, line: 290, size: 8, elements: !721)
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !720, file: !9, line: 291, baseType: !12, size: 8)
!723 = !DILocation(line: 298, column: 5, scope: !717)
!724 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/set.codon','internal.types.collections.set'].474", scope: !9, file: !9, line: 298, type: !725, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!725 = !DISubroutineType(types: !726)
!726 = !{!727, !12}
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/set.codon','internal.types.collections.set']", scope: !9, file: !9, line: 290, size: 8, elements: !728)
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !727, file: !9, line: 291, baseType: !12, size: 8)
!730 = !DILocation(line: 298, column: 5, scope: !724)
!731 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/khash.codon','internal.khash'].476", scope: !9, file: !9, line: 298, type: !732, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!732 = !DISubroutineType(types: !733)
!733 = !{!734, !12}
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/khash.codon','internal.khash']", scope: !9, file: !9, line: 290, size: 8, elements: !735)
!735 = !{!736}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !734, file: !9, line: 291, baseType: !12, size: 8)
!737 = !DILocation(line: 298, column: 5, scope: !731)
!738 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/dict.codon','internal.types.collections.dict'].478", scope: !9, file: !9, line: 298, type: !739, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!739 = !DISubroutineType(types: !740)
!740 = !{!741, !12}
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/dict.codon','internal.types.collections.dict']", scope: !9, file: !9, line: 290, size: 8, elements: !742)
!742 = !{!743}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !741, file: !9, line: 291, baseType: !12, size: 8)
!744 = !DILocation(line: 298, column: 5, scope: !738)
!745 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/tuple.codon','internal.types.collections.tuple'].480", scope: !9, file: !9, line: 298, type: !746, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!746 = !DISubroutineType(types: !747)
!747 = !{!748, !12}
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/tuple.codon','internal.types.collections.tuple']", scope: !9, file: !9, line: 290, size: 8, elements: !749)
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !748, file: !9, line: 291, baseType: !12, size: 8)
!751 = !DILocation(line: 298, column: 5, scope: !745)
!752 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/builtin.codon','internal.builtin'].482", scope: !9, file: !9, line: 298, type: !753, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!753 = !DISubroutineType(types: !754)
!754 = !{!755, !12}
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/builtin.codon','internal.builtin']", scope: !9, file: !9, line: 290, size: 8, elements: !756)
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !755, file: !9, line: 291, baseType: !12, size: 8)
!758 = !DILocation(line: 298, column: 5, scope: !752)
!759 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/str.codon','internal.str'].484", scope: !9, file: !9, line: 298, type: !760, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!760 = !DISubroutineType(types: !761)
!761 = !{!762, !12}
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/str.codon','internal.str']", scope: !9, file: !9, line: 290, size: 8, elements: !763)
!763 = !{!764}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !762, file: !9, line: 291, baseType: !12, size: 8)
!765 = !DILocation(line: 298, column: 5, scope: !759)
!766 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/algorithms/strings.codon','algorithms.strings'].486", scope: !9, file: !9, line: 298, type: !767, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!767 = !DISubroutineType(types: !768)
!768 = !{!769, !12}
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/algorithms/strings.codon','algorithms.strings']", scope: !9, file: !9, line: 290, size: 8, elements: !770)
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !769, file: !9, line: 291, baseType: !12, size: 8)
!772 = !DILocation(line: 298, column: 5, scope: !766)
!773 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/sort.codon','internal.sort'].488", scope: !9, file: !9, line: 298, type: !774, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!774 = !DISubroutineType(types: !775)
!775 = !{!776, !12}
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/sort.codon','internal.sort']", scope: !9, file: !9, line: 290, size: 8, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !776, file: !9, line: 291, baseType: !12, size: 8)
!779 = !DILocation(line: 298, column: 5, scope: !773)
!780 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/algorithms/pdqsort.codon','algorithms.pdqsort'].490", scope: !9, file: !9, line: 298, type: !781, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!781 = !DISubroutineType(types: !782)
!782 = !{!783, !12}
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/algorithms/pdqsort.codon','algorithms.pdqsort']", scope: !9, file: !9, line: 290, size: 8, elements: !784)
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !783, file: !9, line: 291, baseType: !12, size: 8)
!786 = !DILocation(line: 298, column: 5, scope: !780)
!787 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/algorithms/insertionsort.codon','algorithms.insertionsort'].492", scope: !9, file: !9, line: 298, type: !788, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!788 = !DISubroutineType(types: !789)
!789 = !{!790, !12}
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/algorithms/insertionsort.codon','algorithms.insertionsort']", scope: !9, file: !9, line: 290, size: 8, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !790, file: !9, line: 291, baseType: !12, size: 8)
!793 = !DILocation(line: 298, column: 5, scope: !787)
!794 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/algorithms/heapsort.codon','algorithms.heapsort'].494", scope: !9, file: !9, line: 298, type: !795, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!795 = !DISubroutineType(types: !796)
!796 = !{!797, !12}
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/algorithms/heapsort.codon','algorithms.heapsort']", scope: !9, file: !9, line: 290, size: 8, elements: !798)
!798 = !{!799}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !797, file: !9, line: 291, baseType: !12, size: 8)
!800 = !DILocation(line: 298, column: 5, scope: !794)
!801 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/algorithms/qsort.codon','algorithms.qsort'].496", scope: !9, file: !9, line: 298, type: !802, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!802 = !DISubroutineType(types: !803)
!803 = !{!804, !12}
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/algorithms/qsort.codon','algorithms.qsort']", scope: !9, file: !9, line: 290, size: 8, elements: !805)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !804, file: !9, line: 291, baseType: !12, size: 8)
!807 = !DILocation(line: 298, column: 5, scope: !801)
!808 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/algorithms/timsort.codon','algorithms.timsort'].498", scope: !9, file: !9, line: 298, type: !809, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!809 = !DISubroutineType(types: !810)
!810 = !{!811, !12}
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/algorithms/timsort.codon','algorithms.timsort']", scope: !9, file: !9, line: 290, size: 8, elements: !812)
!812 = !{!813}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !811, file: !9, line: 291, baseType: !12, size: 8)
!814 = !DILocation(line: 298, column: 5, scope: !808)
!815 = distinct !DISubprogram(name: "__internal__.opt_tuple_new", linkageName: "__internal__.opt_tuple_new:0[,int].500", scope: !816, file: !816, line: 7, type: !817, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!816 = !DIFile(filename: "optional.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types")
!817 = !DISubroutineType(types: !818)
!818 = !{!819}
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "Optional[int]", scope: !9, file: !9, line: 125, size: 128, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !819, file: !9, line: 125, baseType: !291, size: 8)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !819, file: !9, line: 125, baseType: !271, size: 64, offset: 64)
!823 = !DILocation(line: 7, column: 5, scope: !815)
!824 = distinct !DISubprogram(name: "Optional[int].__new__", linkageName: "Optional[int]:Optional.__new__:0.501", scope: !816, file: !816, line: 13, type: !825, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!825 = !DISubroutineType(types: !826)
!826 = !{!827}
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "Optional[int]", scope: !9, file: !9, line: 125, size: 128, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !827, file: !9, line: 125, baseType: !291, size: 8)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !827, file: !9, line: 125, baseType: !271, size: 64, offset: 64)
!831 = !DILocation(line: 13, column: 5, scope: !824)
!832 = !DILocation(line: 15, column: 20, scope: !824)
!833 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/openmp.codon','openmp'].502", scope: !9, file: !9, line: 298, type: !834, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!834 = !DISubroutineType(types: !835)
!835 = !{!836, !12}
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/openmp.codon','openmp']", scope: !9, file: !9, line: 290, size: 8, elements: !837)
!837 = !{!838}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !836, file: !9, line: 291, baseType: !12, size: 8)
!839 = !DILocation(line: 298, column: 5, scope: !833)
!840 = distinct !DISubprogram(name: "int.__le__", linkageName: "int.__le__:1[int,int].504", scope: !611, file: !611, line: 337, type: !841, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!841 = !DISubroutineType(types: !842)
!842 = !{!12, !271, !271}
!843 = !DILocation(line: 337, column: 5, scope: !840)
!844 = distinct !DISubprogram(name: "_check_bitwidth", linkageName: "std.internal.types.intn._check_bitwidth.0:0[,32].507", scope: !845, file: !845, line: 5, type: !447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!845 = !DIFile(filename: "intn.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types")
!846 = !DILocation(line: 5, column: 1, scope: !844)
!847 = distinct !DISubprogram(name: "int.__lt__", linkageName: "int.__lt__:1[int,int].508", scope: !611, file: !611, line: 305, type: !841, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!848 = !DILocation(line: 305, column: 5, scope: !847)
!849 = distinct !DISubprogram(name: "__internal__.int_trunc", linkageName: "__internal__.int_trunc:0[int,64,32].511", scope: !361, file: !361, line: 369, type: !850, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!850 = !DISubroutineType(types: !851)
!851 = !{!328, !271}
!852 = !DILocation(line: 369, column: 5, scope: !849)
!853 = distinct !DISubprogram(name: "Int32.__new__", linkageName: "Int[32]:Int.__new__:5[int].513", scope: !845, file: !845, line: 58, type: !850, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !854)
!854 = !{!855}
!855 = !DILocalVariable(name: "what", arg: 1, scope: !853, file: !283, type: !271)
!856 = !DILocation(line: 58, column: 5, scope: !853)
!857 = !DILocation(line: 0, scope: !853)
!858 = !DILocation(line: 59, column: 9, scope: !853)
!859 = !DILocation(line: 61, column: 43, scope: !853)
!860 = distinct !DISubprogram(name: "int.__or__", linkageName: "int.__or__:0[int,int].515", scope: !611, file: !611, line: 215, type: !612, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!861 = !DILocation(line: 215, column: 5, scope: !860)
!862 = distinct !DISubprogram(name: "std.openmp.Ident.0.__new__", linkageName: "std.openmp.Ident.0.__new__:0.518", scope: !863, file: !863, line: 444, type: !864, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!863 = !DIFile(filename: "<generated>", directory: ".")
!864 = !DISubroutineType(types: !865)
!865 = !{!866, !328, !328, !328, !328, !266}
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !304, file: !304, line: 46, size: 192, elements: !867)
!867 = !{!868, !869, !870, !871, !872}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !866, file: !304, line: 47, baseType: !328, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !866, file: !304, line: 48, baseType: !328, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !866, file: !304, line: 49, baseType: !328, size: 32, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !866, file: !304, line: 50, baseType: !328, size: 32, offset: 96)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !866, file: !304, line: 51, baseType: !266, size: 64, offset: 128)
!873 = !DILocation(line: 444, column: 444, scope: !862)
!874 = distinct !DISubprogram(name: "std.openmp.Ident.0.__new__", linkageName: "std.openmp.Ident.0.__new__:1[int,str].524", scope: !304, file: !304, line: 53, type: !875, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !888)
!875 = !DISubroutineType(types: !876)
!876 = !{!877, !271, !884}
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !304, file: !304, line: 46, size: 192, elements: !878)
!878 = !{!879, !880, !881, !882, !883}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !877, file: !304, line: 47, baseType: !328, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !877, file: !304, line: 48, baseType: !328, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !877, file: !304, line: 49, baseType: !328, size: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !877, file: !304, line: 50, baseType: !328, size: 32, offset: 96)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !877, file: !304, line: 51, baseType: !266, size: 64, offset: 128)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !884, file: !9, line: 146, baseType: !271, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !884, file: !9, line: 146, baseType: !266, size: 64, offset: 64)
!888 = !{!889, !890}
!889 = !DILocalVariable(name: "flags", arg: 1, scope: !874, file: !283, type: !271)
!890 = !DILocalVariable(name: "source", arg: 2, scope: !874, file: !283, type: !891)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !891, file: !9, line: 146, baseType: !271, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !891, file: !9, line: 146, baseType: !266, size: 64, offset: 64)
!895 = !DILocation(line: 53, column: 5, scope: !874)
!896 = !DILocation(line: 0, scope: !874)
!897 = !DILocation(line: 54, column: 26, scope: !874)
!898 = !DILocation(line: 54, column: 34, scope: !874)
!899 = !DILocation(line: 54, column: 42, scope: !874)
!900 = !DILocation(line: 54, column: 64, scope: !874)
!901 = !DILocation(line: 54, column: 72, scope: !874)
!902 = !DILocation(line: 54, column: 76, scope: !874)
!903 = distinct !DISubprogram(name: "_default_loc", linkageName: "std.openmp._default_loc.0:0.527", scope: !304, file: !304, line: 101, type: !904, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!904 = !DISubroutineType(types: !905)
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !304, file: !304, line: 46, size: 192, elements: !908)
!908 = !{!909, !910, !911, !912, !913}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !907, file: !304, line: 47, baseType: !328, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !907, file: !304, line: 48, baseType: !328, size: 32, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !907, file: !304, line: 49, baseType: !328, size: 32, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !907, file: !304, line: 50, baseType: !328, size: 32, offset: 96)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !907, file: !304, line: 51, baseType: !266, size: 64, offset: 128)
!914 = !DILocation(line: 101, column: 1, scope: !903)
!915 = !DILocation(line: 102, column: 12, scope: !903)
!916 = distinct !DISubprogram(name: "_static_loop_loc", linkageName: "std.openmp._static_loop_loc.0:0.528", scope: !304, file: !304, line: 106, type: !917, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!917 = !DISubroutineType(types: !918)
!918 = !{!919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !304, file: !304, line: 46, size: 192, elements: !921)
!921 = !{!922, !923, !924, !925, !926}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !920, file: !304, line: 47, baseType: !328, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !920, file: !304, line: 48, baseType: !328, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !920, file: !304, line: 49, baseType: !328, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !920, file: !304, line: 50, baseType: !328, size: 32, offset: 96)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !920, file: !304, line: 51, baseType: !266, size: 64, offset: 128)
!927 = !DILocation(line: 106, column: 1, scope: !916)
!928 = !DILocation(line: 107, column: 12, scope: !916)
!929 = distinct !DISubprogram(name: "_reduction_loc", linkageName: "std.openmp._reduction_loc.0:0.529", scope: !304, file: !304, line: 111, type: !930, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!930 = !DISubroutineType(types: !931)
!931 = !{!932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !304, file: !304, line: 46, size: 192, elements: !934)
!934 = !{!935, !936, !937, !938, !939}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !933, file: !304, line: 47, baseType: !328, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !933, file: !304, line: 48, baseType: !328, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !933, file: !304, line: 49, baseType: !328, size: 32, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !933, file: !304, line: 50, baseType: !328, size: 32, offset: 96)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !933, file: !304, line: 51, baseType: !266, size: 64, offset: 128)
!940 = !DILocation(line: 111, column: 1, scope: !929)
!941 = !DILocation(line: 112, column: 12, scope: !929)
!942 = distinct !DISubprogram(name: "std.openmp.Lock.0.__new__", linkageName: "std.openmp.Lock.0.__new__:0.530", scope: !863, file: !863, line: 423, type: !943, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!943 = !DISubroutineType(types: !944)
!944 = !{!945, !328, !328, !328, !328, !328, !328, !328, !328}
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Lock.0", scope: !304, file: !304, line: 31, size: 256, elements: !946)
!946 = !{!947, !948, !949, !950, !951, !952, !953, !954}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !945, file: !304, line: 32, baseType: !328, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !945, file: !304, line: 33, baseType: !328, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !945, file: !304, line: 34, baseType: !328, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !945, file: !304, line: 35, baseType: !328, size: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "a5", scope: !945, file: !304, line: 36, baseType: !328, size: 32, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "a6", scope: !945, file: !304, line: 37, baseType: !328, size: 32, offset: 160)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "a7", scope: !945, file: !304, line: 38, baseType: !328, size: 32, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "a8", scope: !945, file: !304, line: 39, baseType: !328, size: 32, offset: 224)
!955 = !DILocation(line: 423, column: 423, scope: !942)
!956 = distinct !DISubprogram(name: "std.openmp.Lock.0.__new__", linkageName: "std.openmp.Lock.0.__new__:1.539", scope: !304, file: !304, line: 41, type: !957, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !969)
!957 = !DISubroutineType(types: !958)
!958 = !{!959}
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Lock.0", scope: !304, file: !304, line: 31, size: 256, elements: !960)
!960 = !{!961, !962, !963, !964, !965, !966, !967, !968}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !959, file: !304, line: 32, baseType: !328, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !959, file: !304, line: 33, baseType: !328, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !959, file: !304, line: 34, baseType: !328, size: 32, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !959, file: !304, line: 35, baseType: !328, size: 32, offset: 96)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "a5", scope: !959, file: !304, line: 36, baseType: !328, size: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "a6", scope: !959, file: !304, line: 37, baseType: !328, size: 32, offset: 160)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "a7", scope: !959, file: !304, line: 38, baseType: !328, size: 32, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "a8", scope: !959, file: !304, line: 39, baseType: !328, size: 32, offset: 224)
!969 = !{!970}
!970 = !DILocalVariable(name: "z", scope: !956, file: !304, line: 42, type: !328)
!971 = !DILocation(line: 41, column: 5, scope: !956)
!972 = !DILocation(line: 42, column: 9, scope: !956)
!973 = !DILocation(line: 42, column: 17, scope: !956)
!974 = !DILocation(line: 43, column: 21, scope: !956)
!975 = !DILocation(line: 43, column: 24, scope: !956)
!976 = !DILocation(line: 43, column: 27, scope: !956)
!977 = !DILocation(line: 43, column: 30, scope: !956)
!978 = !DILocation(line: 43, column: 33, scope: !956)
!979 = !DILocation(line: 43, column: 36, scope: !956)
!980 = !DILocation(line: 43, column: 39, scope: !956)
!981 = !DILocation(line: 43, column: 42, scope: !956)
!982 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/gpu.codon','gpu'].540", scope: !9, file: !9, line: 298, type: !983, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!983 = !DISubroutineType(types: !984)
!984 = !{!985, !12}
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/gpu.codon','gpu']", scope: !9, file: !9, line: 290, size: 8, elements: !986)
!986 = !{!987}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !985, file: !9, line: 291, baseType: !12, size: 8)
!988 = !DILocation(line: 298, column: 5, scope: !982)
!989 = distinct !DISubprogram(name: "std.gpu.Thread.0.__new__", linkageName: "std.gpu.Thread.0.__new__:0.542", scope: !863, file: !863, line: 636, type: !990, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!990 = !DISubroutineType(types: !991)
!991 = !{!430}
!992 = !DILocation(line: 636, column: 636, scope: !989)
!993 = distinct !DISubprogram(name: "std.gpu.Block.0.__new__", linkageName: "std.gpu.Block.0.__new__:0.543", scope: !863, file: !863, line: 657, type: !994, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!994 = !DISubroutineType(types: !995)
!995 = !{!371}
!996 = !DILocation(line: 657, column: 657, scope: !993)
!997 = distinct !DISubprogram(name: "std.gpu.Grid.0.__new__", linkageName: "std.gpu.Grid.0.__new__:0.544", scope: !863, file: !863, line: 678, type: !998, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!998 = !DISubroutineType(types: !999)
!999 = !{!382}
!1000 = !DILocation(line: 678, column: 678, scope: !997)
!1001 = distinct !DISubprogram(name: "std.gpu.Warp.0.__new__", linkageName: "std.gpu.Warp.0.__new__:0.545", scope: !863, file: !863, line: 699, type: !1002, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!433}
!1004 = !DILocation(line: 699, column: 699, scope: !1001)
!1005 = distinct !DISubprogram(name: "Tuple.__new__", linkageName: "Tuple.__new__:2.546", scope: !1006, file: !1006, line: 33, type: !1007, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1006 = !DIFile(filename: "slice.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types")
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!1009, !430, !371, !382, !433}
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple[std.gpu.Thread.0,std.gpu.Block.0,std.gpu.Grid.0,std.gpu.Warp.0]", scope: !283, file: !283, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !1009, file: !370, line: 222, baseType: !430)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "item2", scope: !1009, file: !370, line: 222, baseType: !371)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "item3", scope: !1009, file: !370, line: 222, baseType: !382)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "item4", scope: !1009, file: !370, line: 222, baseType: !433)
!1015 = !DILocation(line: 33, column: 46, scope: !1005)
!1016 = distinct !DISubprogram(name: "_catch", linkageName: "std.gpu._catch.0:0.551", scope: !370, file: !370, line: 221, type: !1017, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1019}
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple[std.gpu.Thread.0,std.gpu.Block.0,std.gpu.Grid.0,std.gpu.Warp.0]", scope: !283, file: !283, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !1019, file: !370, line: 222, baseType: !430)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "item2", scope: !1019, file: !370, line: 222, baseType: !371)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "item3", scope: !1019, file: !370, line: 222, baseType: !382)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "item4", scope: !1019, file: !370, line: 222, baseType: !433)
!1025 = !DILocation(line: 221, column: 1, scope: !1016)
!1026 = !DILocation(line: 222, column: 13, scope: !1016)
!1027 = !DILocation(line: 222, column: 21, scope: !1016)
!1028 = !DILocation(line: 222, column: 28, scope: !1016)
!1029 = !DILocation(line: 222, column: 34, scope: !1016)
!1030 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/file.codon','internal.file'].552", scope: !9, file: !9, line: 298, type: !1031, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!1033, !12}
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/file.codon','internal.file']", scope: !9, file: !9, line: 290, size: 8, elements: !1034)
!1034 = !{!1035}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !1033, file: !9, line: 291, baseType: !12, size: 8)
!1036 = !DILocation(line: 298, column: 5, scope: !1030)
!1037 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/pickle.codon','pickle'].554", scope: !9, file: !9, line: 298, type: !1038, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!1040, !12}
!1040 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/pickle.codon','pickle']", scope: !9, file: !9, line: 290, size: 8, elements: !1041)
!1041 = !{!1042}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !1040, file: !9, line: 291, baseType: !12, size: 8)
!1043 = !DILocation(line: 298, column: 5, scope: !1037)
!1044 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/dlopen.codon','internal.dlopen'].556", scope: !9, file: !9, line: 298, type: !1045, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!1047, !12}
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/dlopen.codon','internal.dlopen']", scope: !9, file: !9, line: 290, size: 8, elements: !1048)
!1048 = !{!1049}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !1047, file: !9, line: 291, baseType: !12, size: 8)
!1050 = !DILocation(line: 298, column: 5, scope: !1044)
!1051 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/python.codon','internal.python'].558", scope: !9, file: !9, line: 298, type: !1052, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!1054, !12}
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/python.codon','internal.python']", scope: !9, file: !9, line: 290, size: 8, elements: !1055)
!1055 = !{!1056}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !1054, file: !9, line: 291, baseType: !12, size: 8)
!1057 = !DILocation(line: 298, column: 5, scope: !1051)
!1058 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/os/__init__.codon','os.__init__'].560", scope: !9, file: !9, line: 298, type: !1059, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1061, !12}
!1061 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/os/__init__.codon','os.__init__']", scope: !9, file: !9, line: 290, size: 8, elements: !1062)
!1062 = !{!1063}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !1061, file: !9, line: 291, baseType: !12, size: 8)
!1064 = !DILocation(line: 298, column: 5, scope: !1058)
!1065 = distinct !DISubprogram(name: "sizeof", linkageName: "std.internal.gc.sizeof.0:0[,Tuple[int,int,int,int,Ptr[UInt[32]],Ptr[str],Ptr[str]]].571", scope: !616, file: !616, line: 59, type: !625, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1066 = !DILocation(line: 59, column: 1, scope: !1065)
!1067 = !DILocation(line: 60, column: 12, scope: !1065)
!1068 = distinct !DISubprogram(name: "alloc_atomic", linkageName: "std.internal.gc.alloc_atomic.0:0[int].572", scope: !616, file: !616, line: 71, type: !617, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1069)
!1069 = !{!1070}
!1070 = !DILocalVariable(name: "sz", arg: 1, scope: !1068, file: !283, type: !271)
!1071 = !DILocation(line: 71, column: 1, scope: !1068)
!1072 = !DILocation(line: 0, scope: !1068)
!1073 = !DILocation(line: 72, column: 29, scope: !1068)
!1074 = distinct !DISubprogram(name: "alloc", linkageName: "std.internal.gc.alloc.0:0[int].574", scope: !616, file: !616, line: 65, type: !617, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1075)
!1075 = !{!1076}
!1076 = !DILocalVariable(name: "sz", arg: 1, scope: !1074, file: !283, type: !271)
!1077 = !DILocation(line: 65, column: 1, scope: !1074)
!1078 = !DILocation(line: 0, scope: !1074)
!1079 = !DILocation(line: 66, column: 22, scope: !1074)
!1080 = distinct !DISubprogram(name: "Tuple.__new__", linkageName: "Tuple.__new__:7.576", scope: !616, file: !616, line: 103, type: !458, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1081 = !DILocation(line: 103, column: 8, scope: !1080)
!1082 = distinct !DISubprogram(name: "__new__", linkageName: "NamedTuple.__new__:0[Tuple,0,Tuple].577", scope: !9, file: !9, line: 354, type: !1083, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!1085, !258}
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "NamedTuple[0,Tuple]", scope: !9, file: !9, line: 346, elements: !1086)
!1086 = !{!1087}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1085, file: !616, line: 103, baseType: !258)
!1088 = !DILocation(line: 354, column: 5, scope: !1082)
!1089 = distinct !DISubprogram(name: "register_finalizer", linkageName: "std.internal.gc.register_finalizer.0:0[Ptr[byte]].579", scope: !616, file: !616, line: 102, type: !319, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1090)
!1090 = !{!1091}
!1091 = !DILocalVariable(name: "p", arg: 1, scope: !1089, file: !283, type: !266)
!1092 = !DILocation(line: 102, column: 1, scope: !1089)
!1093 = !DILocation(line: 0, scope: !1089)
!1094 = distinct !DISubprogram(name: "__internal__.to_class_ptr", linkageName: "__internal__.to_class_ptr:0[Ptr[byte],std.internal.types.collections.dict.Dict.0[str,str]].581", scope: !361, file: !361, line: 463, type: !1095, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!1097, !266}
!1097 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1098)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict.0[str,str].contents", scope: !283, file: !283, size: 448, elements: !1099)
!1099 = !{!1100, !1102, !1103, !1104, !1105, !1108, !1114}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1098, file: !1101, line: 12, baseType: !271, size: 64)
!1101 = !DIFile(filename: "dict.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections")
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1098, file: !1101, line: 13, baseType: !271, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1098, file: !1101, line: 14, baseType: !271, size: 64, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1098, file: !1101, line: 15, baseType: !271, size: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1098, file: !1101, line: 17, baseType: !1106, size: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIBasicType(name: "UInt32", size: 32, encoding: DW_ATE_unsigned)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1098, file: !1101, line: 18, baseType: !1109, size: 64, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1110, file: !9, line: 146, baseType: !271, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1110, file: !9, line: 146, baseType: !266, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1098, file: !1101, line: 19, baseType: !1109, size: 64, offset: 384)
!1115 = !DILocation(line: 463, column: 5, scope: !1094)
!1116 = distinct !DISubprogram(name: "__internal__.class_alloc", linkageName: "__internal__.class_alloc:0[,std.internal.types.collections.dict.Dict.0[str,str]].583", scope: !361, file: !361, line: 42, type: !1117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1134)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!1119}
!1119 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1120)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict.0[str,str].contents", scope: !283, file: !283, size: 448, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1133}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1120, file: !1101, line: 12, baseType: !271, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1120, file: !1101, line: 13, baseType: !271, size: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1120, file: !1101, line: 14, baseType: !271, size: 64, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1120, file: !1101, line: 15, baseType: !271, size: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1120, file: !1101, line: 17, baseType: !1106, size: 64, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1120, file: !1101, line: 18, baseType: !1128, size: 64, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !1130)
!1130 = !{!1131, !1132}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1129, file: !9, line: 146, baseType: !271, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1129, file: !9, line: 146, baseType: !266, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1120, file: !1101, line: 19, baseType: !1128, size: 64, offset: 384)
!1134 = !{!1135, !1136}
!1135 = !DILocalVariable(name: "sz", scope: !1116, file: !361, line: 44, type: !271)
!1136 = !DILocalVariable(name: "obj", scope: !1116, file: !361, line: 45, type: !266)
!1137 = !DILocation(line: 42, column: 5, scope: !1116)
!1138 = !DILocation(line: 44, column: 9, scope: !1116)
!1139 = !DILocation(line: 45, column: 9, scope: !1116)
!1140 = !DILocation(line: 44, column: 14, scope: !1116)
!1141 = !DILocation(line: 45, column: 35, scope: !1116)
!1142 = !DILocation(line: 45, column: 28, scope: !1116)
!1143 = !DILocation(line: 45, column: 68, scope: !1116)
!1144 = !DILocation(line: 51, column: 32, scope: !1116)
!1145 = !DILocation(line: 52, column: 46, scope: !1116)
!1146 = distinct !DISubprogram(name: "__magic__.new", linkageName: "__magic__.new:0[,std.internal.types.collections.dict.Dict.0[str,str]].584", scope: !361, file: !361, line: 588, type: !1147, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!1149}
!1149 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1150)
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict.0[str,str].contents", scope: !283, file: !283, size: 448, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1155, !1156, !1157, !1163}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1150, file: !1101, line: 12, baseType: !271, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1150, file: !1101, line: 13, baseType: !271, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1150, file: !1101, line: 14, baseType: !271, size: 64, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1150, file: !1101, line: 15, baseType: !271, size: 64, offset: 192)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1150, file: !1101, line: 17, baseType: !1106, size: 64, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1150, file: !1101, line: 18, baseType: !1158, size: 64, offset: 320)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1159, file: !9, line: 146, baseType: !271, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1159, file: !9, line: 146, baseType: !266, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1150, file: !1101, line: 19, baseType: !1158, size: 64, offset: 384)
!1164 = !DILocation(line: 588, column: 5, scope: !1146)
!1165 = !DILocation(line: 590, column: 16, scope: !1146)
!1166 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict.0[str,str].__new__", linkageName: "std.internal.types.collections.dict.Dict.0[str,str]:std.internal.types.collections.dict.Dict.0.__new__:0.585", scope: !863, file: !863, line: 369, type: !1167, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!1169}
!1169 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1170)
!1170 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict.0[str,str].contents", scope: !283, file: !283, size: 448, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1175, !1176, !1177, !1183}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1170, file: !1101, line: 12, baseType: !271, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1170, file: !1101, line: 13, baseType: !271, size: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1170, file: !1101, line: 14, baseType: !271, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1170, file: !1101, line: 15, baseType: !271, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1170, file: !1101, line: 17, baseType: !1106, size: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1170, file: !1101, line: 18, baseType: !1178, size: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !1180)
!1180 = !{!1181, !1182}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1179, file: !9, line: 146, baseType: !271, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1179, file: !9, line: 146, baseType: !266, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1170, file: !1101, line: 19, baseType: !1178, size: 64, offset: 384)
!1184 = !DILocation(line: 369, column: 369, scope: !1166)
!1185 = !DILocation(line: 11, column: 1, scope: !1166)
!1186 = distinct !DISubprogram(name: "Pointer[UInt32].__new__", linkageName: "Ptr[UInt[32]]:Ptr.__new__:0.586", scope: !542, file: !542, line: 7, type: !1187, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!1106}
!1189 = !DILocation(line: 7, column: 5, scope: !1186)
!1190 = distinct !DISubprogram(name: "Pointer[str].__new__", linkageName: "Ptr[str]:Ptr.__new__:0.587", scope: !542, file: !542, line: 7, type: !1191, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!1193}
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !1195)
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1194, file: !9, line: 146, baseType: !271, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1194, file: !9, line: 146, baseType: !266, size: 64, offset: 64)
!1198 = !DILocation(line: 7, column: 5, scope: !1190)
