; ModuleID = 'codon'
source_filename = "/Users/rgt/Desktop/BITS/TurboX/benchmarks/runtime_benchmark.codon"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-darwin24.6.0"

%"std.internal.types.range.range.0:std.internal.types.range.range.0.__iter__:1[std.internal.types.range.range.0].941.Frame" = type { ptr, ptr, i64, { i64, i64, i64 }, i64, i64, i64, i2 }
%"__magic__.iter:0[Tuple[str]].963.Frame" = type { ptr, ptr, { i64, ptr }, { { i64, ptr } }, i2, i8 }
%"Tuple.__iter__:0[Tuple[str],Tuple[str]].965.Frame" = type { ptr, ptr, { i64, ptr }, { { i64, ptr } }, ptr, i2 }
%"__magic__.iter:0[Tuple[str,str,str]].1100.Frame" = type { ptr, ptr, { i64, ptr }, { { i64, ptr }, { i64, ptr }, { i64, ptr } }, i3, i8 }
%"Tuple.__iter__:0[Tuple[str,str,str],Tuple[str,str,str]].1102.Frame" = type { ptr, ptr, { i64, ptr }, { { i64, ptr }, { i64, ptr }, { i64, ptr } }, ptr, i2 }
%"__magic__.iter:0[Tuple[str,str]].1179.Frame" = type { ptr, ptr, { i64, ptr }, { { i64, ptr }, { i64, ptr } }, i2, i8 }
%"Tuple.__iter__:0[Tuple[str,str],Tuple[str,str]].1181.Frame" = type { ptr, ptr, { i64, ptr }, { { i64, ptr }, { i64, ptr } }, ptr, i2 }
%"__magic__.iter:0[Tuple].1200.Frame" = type { ptr, ptr, i64, i2 }
%"Tuple.__iter__:0[Tuple,Tuple].1202.Frame" = type { ptr, ptr, i64, ptr, i2 }

!212 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !210, file: !9, line: 291, baseType: !12, size: 8)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "%_import_os___init___82", linkageName: "%_import_os___init___82.0", scope: !2, file: !215, line: 3, type: !216, isLocal: true, isDefinition: true)
!215 = !DIFile(filename: "python.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/os/__init__.codon','os.__init__']", scope: !9, file: !9, line: 290, size: 8, elements: !217)
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !216, file: !9, line: 291, baseType: !12, size: 8)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "%_import_pickle_69", linkageName: "%_import_pickle_69.0", scope: !2, file: !42, line: 45, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/pickle.codon','pickle']", scope: !9, file: !9, line: 290, size: 8, elements: !222)
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !221, file: !9, line: 291, baseType: !12, size: 8)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "%_import_time_86", linkageName: "%_import_time_86.0", scope: !2, file: !3, line: 4, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/time.codon','time']", scope: !9, file: !9, line: 290, size: 8, elements: !227)
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !226, file: !9, line: 291, baseType: !12, size: 8)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: ".default.NamedTuple.__new__:0.args", linkageName: ".default.NamedTuple.__new__:0.args", scope: !2, file: !9, line: 354, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple", scope: !9, file: !9, line: 153, elements: !232)
!232 = !{}
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: ".default.NamedTuple.get:0.default", linkageName: ".default.NamedTuple.get:0.default", scope: !2, file: !9, line: 364, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoneType", scope: !9, file: !9, line: 100, elements: !232)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: ".default.std.internal.builtin.print.0:0.file", linkageName: ".default.std.internal.builtin.print.0:0.file", scope: !2, file: !238, line: 18, type: !239, isLocal: true, isDefinition: true)
!238 = !DIFile(filename: "builtin.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIBasicType(name: "byte", size: 8, encoding: DW_ATE_signed_char)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: ".default.std.internal.dlopen.dlopen.1:0.flag", linkageName: ".default.std.internal.dlopen.dlopen.1:0.flag", scope: !2, file: !243, line: 23, type: !244, isLocal: true, isDefinition: true)
!243 = !DIFile(filename: "dlopen.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!244 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: ".default.std.internal.file.File.0.read:0.sz", linkageName: ".default.std.internal.file.File.0.read:0.sz", scope: !2, file: !247, line: 53, type: !244, isLocal: true, isDefinition: true)
!247 = !DIFile(filename: "file.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: ".default.std.internal.file.bzFile.0.read:0.sz", linkageName: ".default.std.internal.file.bzFile.0.read:0.sz", scope: !2, file: !247, line: 334, type: !244, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: ".default.std.internal.file.gzFile.0.read:0.sz", linkageName: ".default.std.internal.file.gzFile.0.read:0.sz", scope: !2, file: !247, line: 197, type: !244, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: ".default.std.internal.python._PyWrapError.0.__init__:5.pytype", linkageName: ".default.std.internal.python._PyWrapError.0.__init__:5.pytype", scope: !2, file: !215, line: 1540, type: !254, isLocal: true, isDefinition: true)
!254 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !256, file: !256, size: 64, elements: !257)
!256 = !DIFile(filename: "", directory: ".")
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !255, file: !9, line: 142, baseType: !239, size: 64)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: ".default.std.internal.sort.sorted.0:0.key", linkageName: ".default.std.internal.sort.sorted.0:0.key", scope: !2, file: !20, line: 9, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "Optional[int]", scope: !9, file: !9, line: 125, size: 128, elements: !262)
!262 = !{!263, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !261, file: !9, line: 125, baseType: !264, size: 8)
!264 = !DIBasicType(name: "i1", size: 8, encoding: DW_ATE_boolean)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !261, file: !9, line: 125, baseType: !244, size: 64, offset: 64)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: ".default.std.internal.types.array.List.0.pop:0.idx", linkageName: ".default.std.internal.types.array.List.0.pop:0.idx", scope: !2, file: !268, line: 318, type: !244, isLocal: true, isDefinition: true)
!268 = !DIFile(filename: "list.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections")
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: ".default.std.internal.types.array.List.0.sort:0.key", linkageName: ".default.std.internal.types.array.List.0.sort:0.key", scope: !2, file: !20, line: 62, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "Optional[int]", scope: !9, file: !9, line: 125, size: 128, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !271, file: !9, line: 125, baseType: !264, size: 8)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !271, file: !9, line: 125, baseType: !244, size: 64, offset: 64)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: ".default.std.openmp.for_par.0:0.chunk_size", linkageName: ".default.std.openmp.for_par.0:0.chunk_size", scope: !2, file: !277, line: 888, type: !244, isLocal: true, isDefinition: true)
!277 = !DIFile(filename: "openmp.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib")
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: ".default.std.openmp.for_par.0:0.num_threads", linkageName: ".default.std.openmp.for_par.0:0.num_threads", scope: !2, file: !277, line: 888, type: !244, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: ".default.std.time.gmtime.0:0.secs", linkageName: ".default.std.time.gmtime.0:0.secs", scope: !2, file: !282, line: 164, type: !244, isLocal: true, isDefinition: true)
!282 = !DIFile(filename: "time.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib")
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: ".default.std.time.localtime.0:0.secs", linkageName: ".default.std.time.localtime.0:0.secs", scope: !2, file: !282, line: 156, type: !244, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: ".default.str.replace:0.maxcount", linkageName: ".default.str.replace:0.maxcount", scope: !2, file: !31, line: 726, type: !244, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: ".default.str.rsplit:0.maxsplit", linkageName: ".default.str.rsplit:0.maxsplit", scope: !2, file: !31, line: 598, type: !244, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: ".default.str.split:0.maxsplit", linkageName: ".default.str.split:0.maxsplit", scope: !2, file: !31, line: 564, type: !244, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "ITERATIONS", linkageName: "ITERATIONS.0", scope: !2, file: !3, line: 80, type: !244, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "Py_IncRef", linkageName: "Py_IncRef.0", scope: !2, file: !215, line: 11, type: !295, isLocal: true, isDefinition: true)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!235, !239}
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "_DEFAULT_IDENT", linkageName: "_DEFAULT_IDENT.0", scope: !2, file: !277, line: 97, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !277, file: !277, line: 46, size: 192, elements: !301)
!301 = !{!302, !304, !305, !306, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !300, file: !277, line: 47, baseType: !303, size: 32)
!303 = !DIBasicType(name: "Int32", size: 32, encoding: DW_ATE_signed)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !277, line: 48, baseType: !303, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !300, file: !277, line: 49, baseType: !303, size: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !300, file: !277, line: 50, baseType: !303, size: 32, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !300, file: !277, line: 51, baseType: !239, size: 64, offset: 128)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "_KMP_IDENT_KMPC", linkageName: "_KMP_IDENT_KMPC.0", scope: !2, file: !277, line: 10, type: !244, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "_REDUCTION_IDENT", linkageName: "_REDUCTION_IDENT.0", scope: !2, file: !277, line: 99, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !277, file: !277, line: 46, size: 192, elements: !313)
!313 = !{!314, !315, !316, !317, !318}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !312, file: !277, line: 47, baseType: !303, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !312, file: !277, line: 48, baseType: !303, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !312, file: !277, line: 49, baseType: !303, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !312, file: !277, line: 50, baseType: !303, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !312, file: !277, line: 51, baseType: !239, size: 64, offset: 128)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "_STATIC_LOOP_IDENT", linkageName: "_STATIC_LOOP_IDENT.0", scope: !2, file: !277, line: 98, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !277, file: !277, line: 46, size: 192, elements: !322)
!322 = !{!323, !324, !325, !326, !327}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !321, file: !277, line: 47, baseType: !303, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !321, file: !277, line: 48, baseType: !303, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !321, file: !277, line: 49, baseType: !303, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !321, file: !277, line: 50, baseType: !303, size: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !321, file: !277, line: 51, baseType: !239, size: 64, offset: 128)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "__apple__", linkageName: "__apple__.0", scope: !2, file: !256, type: !244, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "__vtable_size__", linkageName: "__vtable_size__.0", scope: !2, file: !332, line: 11, type: !244, isLocal: true, isDefinition: true)
!332 = !DIFile(filename: "internal.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "__vtables__", linkageName: "__vtables__.0", scope: !2, file: !332, line: 10, type: !335, isLocal: true, isDefinition: true)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "bfloat16", linkageName: "bfloat16.MIN_10_EXP", scope: !2, file: !9, line: 76, type: !244, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "block", linkageName: "block.0", scope: !2, file: !341, line: 217, type: !342, isLocal: true, isDefinition: true)
!341 = !DIFile(filename: "gpu.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib")
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Block.0", scope: !341, file: !341, line: 118, elements: !232)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "float", linkageName: "float.MIN_10_EXP", scope: !2, file: !9, line: 55, type: !244, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "float128", linkageName: "float128.MIN_10_EXP", scope: !2, file: !9, line: 83, type: !244, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "float16", linkageName: "float16.MIN_10_EXP", scope: !2, file: !9, line: 69, type: !244, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "float32", linkageName: "float32.MIN_10_EXP", scope: !2, file: !9, line: 62, type: !244, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "grid", linkageName: "grid.0", scope: !2, file: !341, line: 218, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Grid.0", scope: !341, file: !341, line: 178, elements: !232)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "int", linkageName: "int.MAX", scope: !2, file: !9, line: 48, type: !244, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.ArithmeticError.0._pytype", scope: !2, file: !358, line: 100, type: !239, isLocal: true, isDefinition: true)
!358 = !DIFile(filename: "error.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types")
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.AssertionError.0._pytype", scope: !2, file: !358, line: 148, type: !239, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.AttributeError.0._pytype", scope: !2, file: !358, line: 121, type: !239, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.BaseException.0._pytype", scope: !2, file: !358, line: 5, type: !239, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.CError.0._pytype", scope: !2, file: !358, line: 88, type: !239, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.EOFError.0._pytype", scope: !2, file: !358, line: 154, type: !239, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.Exception.0._pytype", scope: !2, file: !358, line: 36, type: !239, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.IOError.0._pytype", scope: !2, file: !358, line: 55, type: !239, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.IndexError.0._pytype", scope: !2, file: !358, line: 76, type: !239, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.KeyError.0._pytype", scope: !2, file: !358, line: 82, type: !239, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.LookupError.0._pytype", scope: !2, file: !358, line: 67, type: !239, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.NameError.0._pytype", scope: !2, file: !358, line: 43, type: !239, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.NotImplementedError.0._pytype", scope: !2, file: !358, line: 136, type: !239, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.OSError.0._pytype", scope: !2, file: !358, line: 49, type: !239, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.OverflowError.0._pytype", scope: !2, file: !358, line: 115, type: !239, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.RuntimeError.0._pytype", scope: !2, file: !358, line: 127, type: !239, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.StopIteration.0._pytype", scope: !2, file: !358, line: 142, type: !239, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.SystemExit.0._pytype", scope: !2, file: !358, line: 160, type: !239, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.TypeError.0._pytype", scope: !2, file: !358, line: 94, type: !239, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.ValueError.0._pytype", scope: !2, file: !358, line: 61, type: !239, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "std", linkageName: "std.internal.types.error.ZeroDivisionError.0._pytype", scope: !2, file: !358, line: 106, type: !239, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "test_cases", linkageName: "test_cases.0", scope: !2, file: !3, line: 83, type: !401, isLocal: true, isDefinition: true)
!401 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.array.List.0[Tuple[str,str,str]].contents", scope: !256, file: !256, size: 192, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !402, file: !78, line: 52, baseType: !244, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !402, file: !78, line: 53, baseType: !406, size: 128, offset: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Array[Tuple[str,str,str]]", scope: !78, file: !78, line: 53, size: 128, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !406, file: !9, line: 227, baseType: !244, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !406, file: !9, line: 228, baseType: !410, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple[str,str,str]", scope: !256, file: !256, size: 384, elements: !412)
!412 = !{!413, !418, !419}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !411, file: !31, line: 548, baseType: !414, size: 128)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !414, file: !9, line: 146, baseType: !244, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !414, file: !9, line: 146, baseType: !239, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "item2", scope: !411, file: !31, line: 548, baseType: !414, size: 128, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "item3", scope: !411, file: !31, line: 548, baseType: !414, size: 128, offset: 256)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "thread", linkageName: "thread.0", scope: !2, file: !341, line: 216, type: !422, isLocal: true, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Thread.0", scope: !341, file: !341, line: 83, elements: !232)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "warp", linkageName: "warp.0", scope: !2, file: !341, line: 219, type: !425, isLocal: true, isDefinition: true)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Warp.0", scope: !341, file: !341, line: 205, elements: !232)
!426 = !DIFile(filename: "<internal>", directory: ".")
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: ".Array[str]", scope: !256, file: !256, size: 128, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !427, file: !256, baseType: !244, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !427, file: !256, baseType: !431, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !432, file: !9, line: 146, baseType: !244, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !432, file: !9, line: 146, baseType: !239, size: 64, offset: 64)
!436 = !{i32 2, !"Debug Info Version", i32 3}
!437 = !{i32 2, !"Dwarf Version", i32 2}
!438 = distinct !DISubprogram(name: "derives", linkageName: "derives:0.2", scope: !9, file: !9, line: 213, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!439 = !DISubroutineType(types: !440)
!440 = !{!235}
!441 = !DILocation(line: 213, column: 1, scope: !438)
!442 = distinct !DISubprogram(name: "pure", linkageName: "pure:0.3", scope: !9, file: !9, line: 209, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!443 = !DILocation(line: 209, column: 1, scope: !442)
!444 = distinct !DISubprogram(name: "ellipsis.__new__", linkageName: "ellipsis.__new__:0.4", scope: !9, file: !9, line: 277, type: !445, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!445 = !DISubroutineType(types: !446)
!446 = !{!447}
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "ellipsis", scope: !9, file: !9, line: 273, elements: !232)
!448 = !DILocation(line: 277, column: 5, scope: !444)
!449 = distinct !DISubprogram(name: "Tuple.__new__", linkageName: "Tuple.__new__:0.5", scope: !9, file: !9, line: 155, type: !450, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!450 = !DISubroutineType(types: !451)
!451 = !{!231}
!452 = !DILocation(line: 155, column: 5, scope: !449)
!453 = distinct !DISubprogram(name: "NoneType.__new__", linkageName: "NoneType.__new__:0.6", scope: !9, file: !9, line: 221, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!454 = !DILocation(line: 221, column: 5, scope: !453)
!455 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/attributes.codon','internal.attributes'].7", scope: !9, file: !9, line: 298, type: !456, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!456 = !DISubroutineType(types: !457)
!457 = !{!458, !12}
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/attributes.codon','internal.attributes']", scope: !9, file: !9, line: 290, size: 8, elements: !459)
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !458, file: !9, line: 291, baseType: !12, size: 8)
!461 = !DILocation(line: 298, column: 5, scope: !455)
!462 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/static.codon','internal.static'].9", scope: !9, file: !9, line: 298, type: !463, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!463 = !DISubroutineType(types: !464)
!464 = !{!465, !12}
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/static.codon','internal.static']", scope: !9, file: !9, line: 290, size: 8, elements: !466)
!466 = !{!467}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !465, file: !9, line: 291, baseType: !12, size: 8)
!468 = !DILocation(line: 298, column: 5, scope: !462)
!469 = distinct !DISubprogram(name: "no_argument_wrap", linkageName: "std.internal.attributes.no_argument_wrap.0:0.11", scope: !470, file: !470, line: 60, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!470 = !DIFile(filename: "attributes.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!471 = !DILocation(line: 60, column: 1, scope: !469)
!472 = distinct !DISubprogram(name: "overload", linkageName: "overload:0.12", scope: !9, file: !9, line: 318, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!473 = !DILocation(line: 318, column: 1, scope: !472)
!474 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/ptr.codon','internal.types.ptr'].13", scope: !9, file: !9, line: 298, type: !475, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!475 = !DISubroutineType(types: !476)
!476 = !{!477, !12}
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/ptr.codon','internal.types.ptr']", scope: !9, file: !9, line: 290, size: 8, elements: !478)
!478 = !{!479}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !477, file: !9, line: 291, baseType: !12, size: 8)
!480 = !DILocation(line: 298, column: 5, scope: !474)
!481 = distinct !DISubprogram(name: "self_captures", linkageName: "std.internal.attributes.self_captures.0:0.15", scope: !470, file: !470, line: 36, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!482 = !DILocation(line: 36, column: 1, scope: !481)
!483 = distinct !DISubprogram(name: "nocapture", linkageName: "std.internal.attributes.nocapture.0:0.16", scope: !470, file: !470, line: 28, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!484 = !DILocation(line: 28, column: 1, scope: !483)
!485 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/str.codon','internal.types.str'].17", scope: !9, file: !9, line: 298, type: !486, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!486 = !DISubroutineType(types: !487)
!487 = !{!488, !12}
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/str.codon','internal.types.str']", scope: !9, file: !9, line: 290, size: 8, elements: !489)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !488, file: !9, line: 291, baseType: !12, size: 8)
!491 = !DILocation(line: 298, column: 5, scope: !485)
!492 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/int.codon','internal.types.int'].19", scope: !9, file: !9, line: 298, type: !493, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !12}
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/int.codon','internal.types.int']", scope: !9, file: !9, line: 290, size: 8, elements: !496)
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !495, file: !9, line: 291, baseType: !12, size: 8)
!498 = !DILocation(line: 298, column: 5, scope: !492)
!499 = distinct !DISubprogram(name: "associative", linkageName: "std.internal.attributes.associative.0:0.21", scope: !470, file: !470, line: 44, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!500 = !DILocation(line: 44, column: 1, scope: !499)
!501 = distinct !DISubprogram(name: "commutative", linkageName: "std.internal.attributes.commutative.0:0.22", scope: !470, file: !470, line: 40, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!502 = !DILocation(line: 40, column: 1, scope: !501)
!503 = distinct !DISubprogram(name: "distributive", linkageName: "std.internal.attributes.distributive.0:0.23", scope: !470, file: !470, line: 48, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!504 = !DILocation(line: 48, column: 1, scope: !503)
!505 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/bool.codon','internal.types.bool'].24", scope: !9, file: !9, line: 298, type: !506, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!506 = !DISubroutineType(types: !507)
!507 = !{!508, !12}
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/bool.codon','internal.types.bool']", scope: !9, file: !9, line: 290, size: 8, elements: !509)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !508, file: !9, line: 291, baseType: !12, size: 8)
!511 = !DILocation(line: 298, column: 5, scope: !505)
!512 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/array.codon','internal.types.array'].26", scope: !9, file: !9, line: 298, type: !513, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!513 = !DISubroutineType(types: !514)
!514 = !{!515, !12}
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/array.codon','internal.types.array']", scope: !9, file: !9, line: 290, size: 8, elements: !516)
!516 = !{!517}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !515, file: !9, line: 291, baseType: !12, size: 8)
!518 = !DILocation(line: 298, column: 5, scope: !512)
!519 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/gc.codon','internal.gc'].28", scope: !9, file: !9, line: 298, type: !520, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!520 = !DISubroutineType(types: !521)
!521 = !{!522, !12}
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/gc.codon','internal.gc']", scope: !9, file: !9, line: 290, size: 8, elements: !523)
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !522, file: !9, line: 291, baseType: !12, size: 8)
!525 = !DILocation(line: 298, column: 5, scope: !519)
!526 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/error.codon','internal.types.error'].30", scope: !9, file: !9, line: 298, type: !527, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!527 = !DISubroutineType(types: !528)
!528 = !{!529, !12}
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/error.codon','internal.types.error']", scope: !9, file: !9, line: 290, size: 8, elements: !530)
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !529, file: !9, line: 291, baseType: !12, size: 8)
!532 = !DILocation(line: 298, column: 5, scope: !526)
!533 = distinct !DISubprogram(name: "Pointer[byte].__new__", linkageName: "Ptr[byte]:Ptr.__new__:0.32", scope: !534, file: !534, line: 7, type: !535, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!534 = !DIFile(filename: "ptr.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types")
!535 = !DISubroutineType(types: !536)
!536 = !{!239}
!537 = !DILocation(line: 7, column: 5, scope: !533)
!538 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/intn.codon','internal.types.intn'].33", scope: !9, file: !9, line: 298, type: !539, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!539 = !DISubroutineType(types: !540)
!540 = !{!541, !12}
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/intn.codon','internal.types.intn']", scope: !9, file: !9, line: 290, size: 8, elements: !542)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !541, file: !9, line: 291, baseType: !12, size: 8)
!544 = !DILocation(line: 298, column: 5, scope: !538)
!545 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/float.codon','internal.types.float'].35", scope: !9, file: !9, line: 298, type: !546, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!546 = !DISubroutineType(types: !547)
!547 = !{!548, !12}
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/float.codon','internal.types.float']", scope: !9, file: !9, line: 290, size: 8, elements: !549)
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !548, file: !9, line: 291, baseType: !12, size: 8)
!551 = !DILocation(line: 298, column: 5, scope: !545)
!552 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/byte.codon','internal.types.byte'].37", scope: !9, file: !9, line: 298, type: !553, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!553 = !DISubroutineType(types: !554)
!554 = !{!555, !12}
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/byte.codon','internal.types.byte']", scope: !9, file: !9, line: 290, size: 8, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !555, file: !9, line: 291, baseType: !12, size: 8)
!558 = !DILocation(line: 298, column: 5, scope: !552)
!559 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/generator.codon','internal.types.generator'].39", scope: !9, file: !9, line: 298, type: !560, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!560 = !DISubroutineType(types: !561)
!561 = !{!562, !12}
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/generator.codon','internal.types.generator']", scope: !9, file: !9, line: 290, size: 8, elements: !563)
!563 = !{!564}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !562, file: !9, line: 291, baseType: !12, size: 8)
!565 = !DILocation(line: 298, column: 5, scope: !559)
!566 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/optional.codon','internal.types.optional'].41", scope: !9, file: !9, line: 298, type: !567, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!567 = !DISubroutineType(types: !568)
!568 = !{!569, !12}
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/optional.codon','internal.types.optional']", scope: !9, file: !9, line: 290, size: 8, elements: !570)
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !569, file: !9, line: 291, baseType: !12, size: 8)
!572 = !DILocation(line: 298, column: 5, scope: !566)
!573 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/c_stubs.codon','internal.c_stubs'].43", scope: !9, file: !9, line: 298, type: !574, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!574 = !DISubroutineType(types: !575)
!575 = !{!576, !12}
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/c_stubs.codon','internal.c_stubs']", scope: !9, file: !9, line: 290, size: 8, elements: !577)
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !576, file: !9, line: 291, baseType: !12, size: 8)
!579 = !DILocation(line: 298, column: 5, scope: !573)
!580 = distinct !DISubprogram(name: "no_side_effect", linkageName: "std.internal.attributes.no_side_effect.0:0.45", scope: !470, file: !470, line: 24, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!581 = !DILocation(line: 24, column: 1, scope: !580)
!582 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/format.codon','internal.format'].46", scope: !9, file: !9, line: 298, type: !583, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!583 = !DISubroutineType(types: !584)
!584 = !{!585, !12}
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/format.codon','internal.format']", scope: !9, file: !9, line: 290, size: 8, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !585, file: !9, line: 291, baseType: !12, size: 8)
!588 = !DILocation(line: 298, column: 5, scope: !582)
!589 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/internal.codon','internal.internal'].48", scope: !9, file: !9, line: 298, type: !590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!590 = !DISubroutineType(types: !591)
!591 = !{!592, !12}
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/internal.codon','internal.internal']", scope: !9, file: !9, line: 290, size: 8, elements: !593)
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !592, file: !9, line: 291, baseType: !12, size: 8)
!595 = !DILocation(line: 298, column: 5, scope: !589)
!596 = distinct !DISubprogram(name: "Pointer[Pointer[Pointer[byte]]].__new__", linkageName: "Ptr[Ptr[Ptr[byte]]]:Ptr.__new__:0.50", scope: !534, file: !534, line: 7, type: !597, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!597 = !DISubroutineType(types: !598)
!598 = !{!335}
!599 = !DILocation(line: 7, column: 5, scope: !596)
!600 = distinct !DISubprogram(name: "inline", linkageName: "std.internal.attributes.inline.0:0.51", scope: !470, file: !470, line: 12, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!601 = !DILocation(line: 12, column: 1, scope: !600)
!602 = distinct !DISubprogram(name: "int.__add__", linkageName: "int:int.__add__:2[int,int].52", scope: !603, file: !603, line: 103, type: !604, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!603 = !DIFile(filename: "int.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types")
!604 = !DISubroutineType(types: !605)
!605 = !{!244, !244, !244}
!606 = !DILocation(line: 103, column: 5, scope: !602)
!607 = distinct !DISubprogram(name: "alloc_atomic_uncollectable", linkageName: "std.internal.gc.alloc_atomic_uncollectable.0:0[int].57", scope: !608, file: !608, line: 81, type: !609, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !611)
!608 = !DIFile(filename: "gc.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal")
!609 = !DISubroutineType(types: !610)
!610 = !{!239, !244}
!611 = !{!612}
!612 = !DILocalVariable(name: "sz", arg: 1, scope: !607, file: !256, type: !244)
!613 = !DILocation(line: 81, column: 1, scope: !607)
!614 = !DILocation(line: 0, scope: !607)
!615 = !DILocation(line: 82, column: 43, scope: !607)
!616 = distinct !DISubprogram(name: "sizeof", linkageName: "std.internal.gc.sizeof.0:0[,Ptr[Ptr[byte]]].59", scope: !608, file: !608, line: 59, type: !617, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!617 = !DISubroutineType(types: !618)
!618 = !{!244}
!619 = !DILocation(line: 59, column: 1, scope: !616)
!620 = !DILocation(line: 60, column: 12, scope: !616)
!621 = distinct !DISubprogram(name: "int.__mul__", linkageName: "int:int.__mul__:1[int,int].60", scope: !603, file: !603, line: 135, type: !604, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!622 = !DILocation(line: 135, column: 5, scope: !621)
!623 = distinct !DISubprogram(name: "Pointer[Pointer[Pointer[byte]]].__new__", linkageName: "Ptr[Ptr[Ptr[byte]]]:Ptr.__new__:3[Ptr[byte]].63", scope: !534, file: !534, line: 26, type: !624, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!624 = !DISubroutineType(types: !625)
!625 = !{!335, !239}
!626 = !DILocation(line: 26, column: 5, scope: !623)
!627 = distinct !DISubprogram(name: "__internal__.class_populate_vtables", linkageName: "__internal__.class_populate_vtables:0.65", scope: !332, file: !332, line: 75, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!628 = !DILocation(line: 75, column: 5, scope: !627)
!629 = distinct !DISubprogram(name: "__internal__.class_init_vtables", linkageName: "__internal__.class_init_vtables:0.66", scope: !332, file: !332, line: 58, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !630)
!630 = !{!631, !632}
!631 = !DILocalVariable(name: "sz", scope: !629, file: !332, line: 63, type: !244)
!632 = !DILocalVariable(name: "p", scope: !629, file: !332, line: 64, type: !239)
!633 = !DILocation(line: 58, column: 5, scope: !629)
!634 = !DILocation(line: 63, column: 9, scope: !629)
!635 = !DILocation(line: 64, column: 9, scope: !629)
!636 = !DILocation(line: 63, column: 32, scope: !629)
!637 = !DILocation(line: 64, column: 40, scope: !629)
!638 = !DILocation(line: 64, column: 45, scope: !629)
!639 = !DILocation(line: 135, column: 5, scope: !621, inlinedAt: !640)
!640 = distinct !DILocation(line: 64, column: 45, scope: !629)
!641 = !DILocation(line: 65, column: 38, scope: !629)
!642 = !DILocation(line: 66, column: 9, scope: !629)
!643 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/slice.codon','internal.types.slice'].67", scope: !9, file: !9, line: 298, type: !644, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!644 = !DISubroutineType(types: !645)
!645 = !{!646, !12}
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/slice.codon','internal.types.slice']", scope: !9, file: !9, line: 290, size: 8, elements: !647)
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !646, file: !9, line: 291, baseType: !12, size: 8)
!649 = !DILocation(line: 298, column: 5, scope: !643)
!650 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/range.codon','internal.types.range'].459", scope: !9, file: !9, line: 298, type: !651, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!651 = !DISubroutineType(types: !652)
!652 = !{!653, !12}
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/range.codon','internal.types.range']", scope: !9, file: !9, line: 290, size: 8, elements: !654)
!654 = !{!655}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !653, file: !9, line: 291, baseType: !12, size: 8)
!656 = !DILocation(line: 298, column: 5, scope: !650)
!657 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/complex.codon','internal.types.complex'].461", scope: !9, file: !9, line: 298, type: !658, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !12}
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/complex.codon','internal.types.complex']", scope: !9, file: !9, line: 290, size: 8, elements: !661)
!661 = !{!662}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !660, file: !9, line: 291, baseType: !12, size: 8)
!663 = !DILocation(line: 298, column: 5, scope: !657)
!664 = distinct !DISubprogram(name: "Pointer[str].__new__", linkageName: "Ptr.__new__:1.463", scope: !534, file: !534, line: 12, type: !665, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!665 = !DISubroutineType(types: !666)
!666 = !{!667, !244}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !668, file: !9, line: 146, baseType: !244, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !668, file: !9, line: 146, baseType: !239, size: 64, offset: 64)
!672 = !DILocation(line: 12, column: 5, scope: !664)
!673 = distinct !DISubprogram(name: "Array[str].__new__", linkageName: "Array[str]:Array.__new__:0[Ptr[str],int].465", scope: !78, file: !78, line: 10, type: !674, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!674 = !DISubroutineType(types: !675)
!675 = !{!676, !680, !244}
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "Array[str]", scope: !78, file: !78, line: 53, size: 128, elements: !677)
!677 = !{!678, !679}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !676, file: !9, line: 227, baseType: !244, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !676, file: !9, line: 228, baseType: !680, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !681, file: !9, line: 146, baseType: !244, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !681, file: !9, line: 146, baseType: !239, size: 64, offset: 64)
!685 = !DILocation(line: 10, column: 5, scope: !673)
!686 = distinct !DISubprogram(name: "Array[str].__new__", linkageName: "Array[str]:Array.__new__:1[int].468", scope: !78, file: !78, line: 16, type: !687, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !698)
!687 = !DISubroutineType(types: !688)
!688 = !{!689, !244}
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Array[str]", scope: !78, file: !78, line: 53, size: 128, elements: !690)
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !689, file: !9, line: 227, baseType: !244, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !689, file: !9, line: 228, baseType: !693, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !695)
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !694, file: !9, line: 146, baseType: !244, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !694, file: !9, line: 146, baseType: !239, size: 64, offset: 64)
!698 = !{!699}
!699 = !DILocalVariable(name: "sz", arg: 1, scope: !686, file: !256, type: !244)
!700 = !DILocation(line: 16, column: 5, scope: !686)
!701 = !DILocation(line: 0, scope: !686)
!702 = !DILocation(line: 17, column: 32, scope: !686)
!703 = !DILocation(line: 12, column: 5, scope: !664, inlinedAt: !704)
!704 = distinct !DILocation(line: 17, column: 32, scope: !686)
!705 = !DILocation(line: 17, column: 37, scope: !686)
!706 = !DILocation(line: 10, column: 5, scope: !673, inlinedAt: !707)
!707 = distinct !DILocation(line: 17, column: 37, scope: !686)
!708 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/strbuf.codon','internal.types.strbuf'].470", scope: !9, file: !9, line: 298, type: !709, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!709 = !DISubroutineType(types: !710)
!710 = !{!711, !12}
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/strbuf.codon','internal.types.strbuf']", scope: !9, file: !9, line: 290, size: 8, elements: !712)
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !711, file: !9, line: 291, baseType: !12, size: 8)
!714 = !DILocation(line: 298, column: 5, scope: !708)
!715 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/list.codon','internal.types.collections.list'].472", scope: !9, file: !9, line: 298, type: !716, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!716 = !DISubroutineType(types: !717)
!717 = !{!718, !12}
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/list.codon','internal.types.collections.list']", scope: !9, file: !9, line: 290, size: 8, elements: !719)
!719 = !{!720}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !718, file: !9, line: 291, baseType: !12, size: 8)
!721 = !DILocation(line: 298, column: 5, scope: !715)
!722 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/set.codon','internal.types.collections.set'].474", scope: !9, file: !9, line: 298, type: !723, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!723 = !DISubroutineType(types: !724)
!724 = !{!725, !12}
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/set.codon','internal.types.collections.set']", scope: !9, file: !9, line: 290, size: 8, elements: !726)
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !725, file: !9, line: 291, baseType: !12, size: 8)
!728 = !DILocation(line: 298, column: 5, scope: !722)
!729 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/khash.codon','internal.khash'].476", scope: !9, file: !9, line: 298, type: !730, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!730 = !DISubroutineType(types: !731)
!731 = !{!732, !12}
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/khash.codon','internal.khash']", scope: !9, file: !9, line: 290, size: 8, elements: !733)
!733 = !{!734}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !732, file: !9, line: 291, baseType: !12, size: 8)
!735 = !DILocation(line: 298, column: 5, scope: !729)
!736 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/dict.codon','internal.types.collections.dict'].478", scope: !9, file: !9, line: 298, type: !737, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!737 = !DISubroutineType(types: !738)
!738 = !{!739, !12}
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/dict.codon','internal.types.collections.dict']", scope: !9, file: !9, line: 290, size: 8, elements: !740)
!740 = !{!741}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !739, file: !9, line: 291, baseType: !12, size: 8)
!742 = !DILocation(line: 298, column: 5, scope: !736)
!743 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/tuple.codon','internal.types.collections.tuple'].480", scope: !9, file: !9, line: 298, type: !744, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!744 = !DISubroutineType(types: !745)
!745 = !{!746, !12}
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections/tuple.codon','internal.types.collections.tuple']", scope: !9, file: !9, line: 290, size: 8, elements: !747)
!747 = !{!748}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !746, file: !9, line: 291, baseType: !12, size: 8)
!749 = !DILocation(line: 298, column: 5, scope: !743)
!750 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/builtin.codon','internal.builtin'].482", scope: !9, file: !9, line: 298, type: !751, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!751 = !DISubroutineType(types: !752)
!752 = !{!753, !12}
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/builtin.codon','internal.builtin']", scope: !9, file: !9, line: 290, size: 8, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !753, file: !9, line: 291, baseType: !12, size: 8)
!756 = !DILocation(line: 298, column: 5, scope: !750)
!757 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/str.codon','internal.str'].484", scope: !9, file: !9, line: 298, type: !758, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!758 = !DISubroutineType(types: !759)
!759 = !{!760, !12}
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/str.codon','internal.str']", scope: !9, file: !9, line: 290, size: 8, elements: !761)
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !760, file: !9, line: 291, baseType: !12, size: 8)
!763 = !DILocation(line: 298, column: 5, scope: !757)
!764 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/algorithms/strings.codon','algorithms.strings'].486", scope: !9, file: !9, line: 298, type: !765, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!765 = !DISubroutineType(types: !766)
!766 = !{!767, !12}
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/algorithms/strings.codon','algorithms.strings']", scope: !9, file: !9, line: 290, size: 8, elements: !768)
!768 = !{!769}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !767, file: !9, line: 291, baseType: !12, size: 8)
!770 = !DILocation(line: 298, column: 5, scope: !764)
!771 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/sort.codon','internal.sort'].488", scope: !9, file: !9, line: 298, type: !772, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!772 = !DISubroutineType(types: !773)
!773 = !{!774, !12}
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/sort.codon','internal.sort']", scope: !9, file: !9, line: 290, size: 8, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !774, file: !9, line: 291, baseType: !12, size: 8)
!777 = !DILocation(line: 298, column: 5, scope: !771)
!778 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/algorithms/pdqsort.codon','algorithms.pdqsort'].490", scope: !9, file: !9, line: 298, type: !779, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!779 = !DISubroutineType(types: !780)
!780 = !{!781, !12}
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/algorithms/pdqsort.codon','algorithms.pdqsort']", scope: !9, file: !9, line: 290, size: 8, elements: !782)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !781, file: !9, line: 291, baseType: !12, size: 8)
!784 = !DILocation(line: 298, column: 5, scope: !778)
!785 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/algorithms/insertionsort.codon','algorithms.insertionsort'].492", scope: !9, file: !9, line: 298, type: !786, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!786 = !DISubroutineType(types: !787)
!787 = !{!788, !12}
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/algorithms/insertionsort.codon','algorithms.insertionsort']", scope: !9, file: !9, line: 290, size: 8, elements: !789)
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !788, file: !9, line: 291, baseType: !12, size: 8)
!791 = !DILocation(line: 298, column: 5, scope: !785)
!792 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/algorithms/heapsort.codon','algorithms.heapsort'].494", scope: !9, file: !9, line: 298, type: !793, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!793 = !DISubroutineType(types: !794)
!794 = !{!795, !12}
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/algorithms/heapsort.codon','algorithms.heapsort']", scope: !9, file: !9, line: 290, size: 8, elements: !796)
!796 = !{!797}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !795, file: !9, line: 291, baseType: !12, size: 8)
!798 = !DILocation(line: 298, column: 5, scope: !792)
!799 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/algorithms/qsort.codon','algorithms.qsort'].496", scope: !9, file: !9, line: 298, type: !800, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!800 = !DISubroutineType(types: !801)
!801 = !{!802, !12}
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/algorithms/qsort.codon','algorithms.qsort']", scope: !9, file: !9, line: 290, size: 8, elements: !803)
!803 = !{!804}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !802, file: !9, line: 291, baseType: !12, size: 8)
!805 = !DILocation(line: 298, column: 5, scope: !799)
!806 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/algorithms/timsort.codon','algorithms.timsort'].498", scope: !9, file: !9, line: 298, type: !807, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!807 = !DISubroutineType(types: !808)
!808 = !{!809, !12}
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/algorithms/timsort.codon','algorithms.timsort']", scope: !9, file: !9, line: 290, size: 8, elements: !810)
!810 = !{!811}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !809, file: !9, line: 291, baseType: !12, size: 8)
!812 = !DILocation(line: 298, column: 5, scope: !806)
!813 = distinct !DISubprogram(name: "__internal__.opt_tuple_new", linkageName: "__internal__.opt_tuple_new:0[,int].500", scope: !814, file: !814, line: 7, type: !815, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!814 = !DIFile(filename: "optional.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types")
!815 = !DISubroutineType(types: !816)
!816 = !{!817}
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "Optional[int]", scope: !9, file: !9, line: 125, size: 128, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !817, file: !9, line: 125, baseType: !264, size: 8)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !817, file: !9, line: 125, baseType: !244, size: 64, offset: 64)
!821 = !DILocation(line: 7, column: 5, scope: !813)
!822 = distinct !DISubprogram(name: "Optional[int].__new__", linkageName: "Optional[int]:Optional.__new__:0.501", scope: !814, file: !814, line: 13, type: !823, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!823 = !DISubroutineType(types: !824)
!824 = !{!825}
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "Optional[int]", scope: !9, file: !9, line: 125, size: 128, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !825, file: !9, line: 125, baseType: !264, size: 8)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !825, file: !9, line: 125, baseType: !244, size: 64, offset: 64)
!829 = !DILocation(line: 13, column: 5, scope: !822)
!830 = !DILocation(line: 15, column: 20, scope: !822)
!831 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/openmp.codon','openmp'].502", scope: !9, file: !9, line: 298, type: !832, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!832 = !DISubroutineType(types: !833)
!833 = !{!834, !12}
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/openmp.codon','openmp']", scope: !9, file: !9, line: 290, size: 8, elements: !835)
!835 = !{!836}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !834, file: !9, line: 291, baseType: !12, size: 8)
!837 = !DILocation(line: 298, column: 5, scope: !831)
!838 = distinct !DISubprogram(name: "int.__le__", linkageName: "int.__le__:1[int,int].504", scope: !603, file: !603, line: 337, type: !839, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!839 = !DISubroutineType(types: !840)
!840 = !{!12, !244, !244}
!841 = !DILocation(line: 337, column: 5, scope: !838)
!842 = distinct !DISubprogram(name: "_check_bitwidth", linkageName: "std.internal.types.intn._check_bitwidth.0:0[,32].507", scope: !843, file: !843, line: 5, type: !439, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!843 = !DIFile(filename: "intn.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types")
!844 = !DILocation(line: 5, column: 1, scope: !842)
!845 = distinct !DISubprogram(name: "int.__lt__", linkageName: "int.__lt__:1[int,int].508", scope: !603, file: !603, line: 305, type: !839, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!846 = !DILocation(line: 305, column: 5, scope: !845)
!847 = distinct !DISubprogram(name: "__internal__.int_trunc", linkageName: "__internal__.int_trunc:0[int,64,32].511", scope: !332, file: !332, line: 369, type: !848, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!848 = !DISubroutineType(types: !849)
!849 = !{!303, !244}
!850 = !DILocation(line: 369, column: 5, scope: !847)
!851 = distinct !DISubprogram(name: "Int32.__new__", linkageName: "Int[32]:Int.__new__:5[int].513", scope: !843, file: !843, line: 58, type: !848, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !852)
!852 = !{!853}
!853 = !DILocalVariable(name: "what", arg: 1, scope: !851, file: !256, type: !244)
!854 = !DILocation(line: 58, column: 5, scope: !851)
!855 = !DILocation(line: 0, scope: !851)
!856 = !DILocation(line: 59, column: 9, scope: !851)
!857 = !DILocation(line: 61, column: 43, scope: !851)
!858 = !DILocation(line: 369, column: 5, scope: !847, inlinedAt: !859)
!859 = distinct !DILocation(line: 61, column: 43, scope: !851)
!860 = distinct !DISubprogram(name: "int.__or__", linkageName: "int.__or__:0[int,int].515", scope: !603, file: !603, line: 215, type: !604, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!861 = !DILocation(line: 215, column: 5, scope: !860)
!862 = distinct !DISubprogram(name: "std.openmp.Ident.0.__new__", linkageName: "std.openmp.Ident.0.__new__:0.518", scope: !863, file: !863, line: 444, type: !864, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!863 = !DIFile(filename: "<generated>", directory: ".")
!864 = !DISubroutineType(types: !865)
!865 = !{!866, !303, !303, !303, !303, !239}
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !277, file: !277, line: 46, size: 192, elements: !867)
!867 = !{!868, !869, !870, !871, !872}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !866, file: !277, line: 47, baseType: !303, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !866, file: !277, line: 48, baseType: !303, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !866, file: !277, line: 49, baseType: !303, size: 32, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !866, file: !277, line: 50, baseType: !303, size: 32, offset: 96)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !866, file: !277, line: 51, baseType: !239, size: 64, offset: 128)
!873 = !DILocation(line: 444, column: 444, scope: !862)
!874 = distinct !DISubprogram(name: "std.openmp.Ident.0.__new__", linkageName: "std.openmp.Ident.0.__new__:1[int,str].524", scope: !277, file: !277, line: 53, type: !875, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !888)
!875 = !DISubroutineType(types: !876)
!876 = !{!877, !244, !884}
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !277, file: !277, line: 46, size: 192, elements: !878)
!878 = !{!879, !880, !881, !882, !883}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !877, file: !277, line: 47, baseType: !303, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !877, file: !277, line: 48, baseType: !303, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !877, file: !277, line: 49, baseType: !303, size: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !877, file: !277, line: 50, baseType: !303, size: 32, offset: 96)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !877, file: !277, line: 51, baseType: !239, size: 64, offset: 128)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !884, file: !9, line: 146, baseType: !244, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !884, file: !9, line: 146, baseType: !239, size: 64, offset: 64)
!888 = !{!889, !890}
!889 = !DILocalVariable(name: "flags", arg: 1, scope: !874, file: !256, type: !244)
!890 = !DILocalVariable(name: "source", arg: 2, scope: !874, file: !256, type: !891)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !891, file: !9, line: 146, baseType: !244, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !891, file: !9, line: 146, baseType: !239, size: 64, offset: 64)
!895 = !DILocation(line: 53, column: 5, scope: !874)
!896 = !DILocation(line: 0, scope: !874)
!897 = !DILocation(line: 54, column: 26, scope: !874)
!898 = !DILocation(line: 54, column: 34, scope: !874)
!899 = !DILocation(line: 54, column: 42, scope: !874)
!900 = !DILocation(line: 215, column: 5, scope: !860, inlinedAt: !901)
!901 = distinct !DILocation(line: 54, column: 42, scope: !874)
!902 = !DILocation(line: 54, column: 64, scope: !874)
!903 = !DILocation(line: 54, column: 72, scope: !874)
!904 = !DILocation(line: 54, column: 76, scope: !874)
!905 = !DILocation(line: 444, column: 444, scope: !862, inlinedAt: !906)
!906 = distinct !DILocation(line: 54, column: 76, scope: !874)
!907 = distinct !DISubprogram(name: "_default_loc", linkageName: "std.openmp._default_loc.0:0.527", scope: !277, file: !277, line: 101, type: !908, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!908 = !DISubroutineType(types: !909)
!909 = !{!910}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !277, file: !277, line: 46, size: 192, elements: !912)
!912 = !{!913, !914, !915, !916, !917}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !911, file: !277, line: 47, baseType: !303, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !911, file: !277, line: 48, baseType: !303, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !911, file: !277, line: 49, baseType: !303, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !911, file: !277, line: 50, baseType: !303, size: 32, offset: 96)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !911, file: !277, line: 51, baseType: !239, size: 64, offset: 128)
!918 = !DILocation(line: 101, column: 1, scope: !907)
!919 = !DILocation(line: 102, column: 12, scope: !907)
!920 = distinct !DISubprogram(name: "_static_loop_loc", linkageName: "std.openmp._static_loop_loc.0:0.528", scope: !277, file: !277, line: 106, type: !921, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!921 = !DISubroutineType(types: !922)
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !277, file: !277, line: 46, size: 192, elements: !925)
!925 = !{!926, !927, !928, !929, !930}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !924, file: !277, line: 47, baseType: !303, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !924, file: !277, line: 48, baseType: !303, size: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !924, file: !277, line: 49, baseType: !303, size: 32, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !924, file: !277, line: 50, baseType: !303, size: 32, offset: 96)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !924, file: !277, line: 51, baseType: !239, size: 64, offset: 128)
!931 = !DILocation(line: 106, column: 1, scope: !920)
!932 = !DILocation(line: 107, column: 12, scope: !920)
!933 = distinct !DISubprogram(name: "_reduction_loc", linkageName: "std.openmp._reduction_loc.0:0.529", scope: !277, file: !277, line: 111, type: !934, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!934 = !DISubroutineType(types: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident.0", scope: !277, file: !277, line: 46, size: 192, elements: !938)
!938 = !{!939, !940, !941, !942, !943}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !937, file: !277, line: 47, baseType: !303, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !937, file: !277, line: 48, baseType: !303, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !937, file: !277, line: 49, baseType: !303, size: 32, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !937, file: !277, line: 50, baseType: !303, size: 32, offset: 96)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !937, file: !277, line: 51, baseType: !239, size: 64, offset: 128)
!944 = !DILocation(line: 111, column: 1, scope: !933)
!945 = !DILocation(line: 112, column: 12, scope: !933)
!946 = distinct !DISubprogram(name: "std.openmp.Lock.0.__new__", linkageName: "std.openmp.Lock.0.__new__:0.530", scope: !863, file: !863, line: 423, type: !947, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!947 = !DISubroutineType(types: !948)
!948 = !{!949, !303, !303, !303, !303, !303, !303, !303, !303}
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Lock.0", scope: !277, file: !277, line: 31, size: 256, elements: !950)
!950 = !{!951, !952, !953, !954, !955, !956, !957, !958}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !949, file: !277, line: 32, baseType: !303, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !949, file: !277, line: 33, baseType: !303, size: 32, offset: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !949, file: !277, line: 34, baseType: !303, size: 32, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !949, file: !277, line: 35, baseType: !303, size: 32, offset: 96)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "a5", scope: !949, file: !277, line: 36, baseType: !303, size: 32, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "a6", scope: !949, file: !277, line: 37, baseType: !303, size: 32, offset: 160)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "a7", scope: !949, file: !277, line: 38, baseType: !303, size: 32, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "a8", scope: !949, file: !277, line: 39, baseType: !303, size: 32, offset: 224)
!959 = !DILocation(line: 423, column: 423, scope: !946)
!960 = distinct !DISubprogram(name: "std.openmp.Lock.0.__new__", linkageName: "std.openmp.Lock.0.__new__:1.539", scope: !277, file: !277, line: 41, type: !961, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !973)
!961 = !DISubroutineType(types: !962)
!962 = !{!963}
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Lock.0", scope: !277, file: !277, line: 31, size: 256, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !970, !971, !972}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !963, file: !277, line: 32, baseType: !303, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !963, file: !277, line: 33, baseType: !303, size: 32, offset: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !963, file: !277, line: 34, baseType: !303, size: 32, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !963, file: !277, line: 35, baseType: !303, size: 32, offset: 96)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "a5", scope: !963, file: !277, line: 36, baseType: !303, size: 32, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "a6", scope: !963, file: !277, line: 37, baseType: !303, size: 32, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "a7", scope: !963, file: !277, line: 38, baseType: !303, size: 32, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "a8", scope: !963, file: !277, line: 39, baseType: !303, size: 32, offset: 224)
!973 = !{!974}
!974 = !DILocalVariable(name: "z", scope: !960, file: !277, line: 42, type: !303)
!975 = !DILocation(line: 41, column: 5, scope: !960)
!976 = !DILocation(line: 42, column: 9, scope: !960)
!977 = !DILocation(line: 42, column: 17, scope: !960)
!978 = !DILocation(line: 43, column: 21, scope: !960)
!979 = !DILocation(line: 43, column: 24, scope: !960)
!980 = !DILocation(line: 43, column: 27, scope: !960)
!981 = !DILocation(line: 43, column: 30, scope: !960)
!982 = !DILocation(line: 43, column: 33, scope: !960)
!983 = !DILocation(line: 43, column: 36, scope: !960)
!984 = !DILocation(line: 43, column: 39, scope: !960)
!985 = !DILocation(line: 43, column: 42, scope: !960)
!986 = !DILocation(line: 423, column: 423, scope: !946, inlinedAt: !987)
!987 = distinct !DILocation(line: 43, column: 42, scope: !960)
!988 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/gpu.codon','gpu'].540", scope: !9, file: !9, line: 298, type: !989, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!989 = !DISubroutineType(types: !990)
!990 = !{!991, !12}
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/gpu.codon','gpu']", scope: !9, file: !9, line: 290, size: 8, elements: !992)
!992 = !{!993}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !991, file: !9, line: 291, baseType: !12, size: 8)
!994 = !DILocation(line: 298, column: 5, scope: !988)
!995 = distinct !DISubprogram(name: "std.gpu.Thread.0.__new__", linkageName: "std.gpu.Thread.0.__new__:0.542", scope: !863, file: !863, line: 636, type: !996, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!996 = !DISubroutineType(types: !997)
!997 = !{!422}
!998 = !DILocation(line: 636, column: 636, scope: !995)
!999 = distinct !DISubprogram(name: "std.gpu.Block.0.__new__", linkageName: "std.gpu.Block.0.__new__:0.543", scope: !863, file: !863, line: 657, type: !1000, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!342}
!1002 = !DILocation(line: 657, column: 657, scope: !999)
!1003 = distinct !DISubprogram(name: "std.gpu.Grid.0.__new__", linkageName: "std.gpu.Grid.0.__new__:0.544", scope: !863, file: !863, line: 678, type: !1004, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!353}
!1006 = !DILocation(line: 678, column: 678, scope: !1003)
!1007 = distinct !DISubprogram(name: "std.gpu.Warp.0.__new__", linkageName: "std.gpu.Warp.0.__new__:0.545", scope: !863, file: !863, line: 699, type: !1008, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!425}
!1010 = !DILocation(line: 699, column: 699, scope: !1007)
!1011 = distinct !DISubprogram(name: "Tuple.__new__", linkageName: "Tuple.__new__:2.546", scope: !1012, file: !1012, line: 33, type: !1013, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1012 = !DIFile(filename: "slice.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types")
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!1015, !422, !342, !353, !425}
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple[std.gpu.Thread.0,std.gpu.Block.0,std.gpu.Grid.0,std.gpu.Warp.0]", scope: !256, file: !256, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !1015, file: !341, line: 222, baseType: !422)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "item2", scope: !1015, file: !341, line: 222, baseType: !342)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "item3", scope: !1015, file: !341, line: 222, baseType: !353)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "item4", scope: !1015, file: !341, line: 222, baseType: !425)
!1021 = !DILocation(line: 33, column: 46, scope: !1011)
!1022 = distinct !DISubprogram(name: "_catch", linkageName: "std.gpu._catch.0:0.551", scope: !341, file: !341, line: 221, type: !1023, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1025}
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple[std.gpu.Thread.0,std.gpu.Block.0,std.gpu.Grid.0,std.gpu.Warp.0]", scope: !256, file: !256, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !1025, file: !341, line: 222, baseType: !422)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "item2", scope: !1025, file: !341, line: 222, baseType: !342)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "item3", scope: !1025, file: !341, line: 222, baseType: !353)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "item4", scope: !1025, file: !341, line: 222, baseType: !425)
!1031 = !DILocation(line: 221, column: 1, scope: !1022)
!1032 = !DILocation(line: 222, column: 13, scope: !1022)
!1033 = !DILocation(line: 222, column: 21, scope: !1022)
!1034 = !DILocation(line: 222, column: 28, scope: !1022)
!1035 = !DILocation(line: 222, column: 34, scope: !1022)
!1036 = !DILocation(line: 33, column: 46, scope: !1011, inlinedAt: !1037)
!1037 = distinct !DILocation(line: 222, column: 34, scope: !1022)
!1038 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/file.codon','internal.file'].552", scope: !9, file: !9, line: 298, type: !1039, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1041, !12}
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/file.codon','internal.file']", scope: !9, file: !9, line: 290, size: 8, elements: !1042)
!1042 = !{!1043}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !1041, file: !9, line: 291, baseType: !12, size: 8)
!1044 = !DILocation(line: 298, column: 5, scope: !1038)
!1045 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/pickle.codon','pickle'].554", scope: !9, file: !9, line: 298, type: !1046, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!1048, !12}
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/pickle.codon','pickle']", scope: !9, file: !9, line: 290, size: 8, elements: !1049)
!1049 = !{!1050}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !1048, file: !9, line: 291, baseType: !12, size: 8)
!1051 = !DILocation(line: 298, column: 5, scope: !1045)
!1052 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/dlopen.codon','internal.dlopen'].556", scope: !9, file: !9, line: 298, type: !1053, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!1055, !12}
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/dlopen.codon','internal.dlopen']", scope: !9, file: !9, line: 290, size: 8, elements: !1056)
!1056 = !{!1057}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !1055, file: !9, line: 291, baseType: !12, size: 8)
!1058 = !DILocation(line: 298, column: 5, scope: !1052)
!1059 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/internal/python.codon','internal.python'].558", scope: !9, file: !9, line: 298, type: !1060, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!1062, !12}
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/internal/python.codon','internal.python']", scope: !9, file: !9, line: 290, size: 8, elements: !1063)
!1063 = !{!1064}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !1062, file: !9, line: 291, baseType: !12, size: 8)
!1065 = !DILocation(line: 298, column: 5, scope: !1059)
!1066 = distinct !DISubprogram(name: "__new__", linkageName: "Import.__new__:0[bool,'/Users/rgt/.codon/lib/codon/stdlib/os/__init__.codon','os.__init__'].560", scope: !9, file: !9, line: 298, type: !1067, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!1069, !12}
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "Import['/Users/rgt/.codon/lib/codon/stdlib/os/__init__.codon','os.__init__']", scope: !9, file: !9, line: 290, size: 8, elements: !1070)
!1070 = !{!1071}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "loaded", scope: !1069, file: !9, line: 291, baseType: !12, size: 8)
!1072 = !DILocation(line: 298, column: 5, scope: !1066)
!1073 = distinct !DISubprogram(name: "sizeof", linkageName: "std.internal.gc.sizeof.0:0[,Tuple[int,int,int,int,Ptr[UInt[32]],Ptr[str],Ptr[str]]].571", scope: !608, file: !608, line: 59, type: !617, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1074 = !DILocation(line: 59, column: 1, scope: !1073)
!1075 = !DILocation(line: 60, column: 12, scope: !1073)
!1076 = distinct !DISubprogram(name: "alloc_atomic", linkageName: "std.internal.gc.alloc_atomic.0:0[int].572", scope: !608, file: !608, line: 71, type: !609, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1077)
!1077 = !{!1078}
!1078 = !DILocalVariable(name: "sz", arg: 1, scope: !1076, file: !256, type: !244)
!1079 = !DILocation(line: 71, column: 1, scope: !1076)
!1080 = !DILocation(line: 0, scope: !1076)
!1081 = !DILocation(line: 72, column: 29, scope: !1076)
!1082 = distinct !DISubprogram(name: "alloc", linkageName: "std.internal.gc.alloc.0:0[int].574", scope: !608, file: !608, line: 65, type: !609, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1083)
!1083 = !{!1084}
!1084 = !DILocalVariable(name: "sz", arg: 1, scope: !1082, file: !256, type: !244)
!1085 = !DILocation(line: 65, column: 1, scope: !1082)
!1086 = !DILocation(line: 0, scope: !1082)
!1087 = !DILocation(line: 66, column: 22, scope: !1082)
!1088 = distinct !DISubprogram(name: "Tuple.__new__", linkageName: "Tuple.__new__:7.576", scope: !608, file: !608, line: 103, type: !450, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1089 = !DILocation(line: 103, column: 8, scope: !1088)
!1090 = distinct !DISubprogram(name: "__new__", linkageName: "NamedTuple.__new__:0[Tuple,0,Tuple].577", scope: !9, file: !9, line: 354, type: !1091, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!1093, !231}
!1093 = !DICompositeType(tag: DW_TAG_structure_type, name: "NamedTuple[0,Tuple]", scope: !9, file: !9, line: 346, elements: !1094)
!1094 = !{!1095}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1093, file: !608, line: 103, baseType: !231)
!1096 = !DILocation(line: 354, column: 5, scope: !1090)
!1097 = distinct !DISubprogram(name: "register_finalizer", linkageName: "std.internal.gc.register_finalizer.0:0[Ptr[byte]].579", scope: !608, file: !608, line: 102, type: !296, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1098)
!1098 = !{!1099}
!1099 = !DILocalVariable(name: "p", arg: 1, scope: !1097, file: !256, type: !239)
!1100 = !DILocation(line: 102, column: 1, scope: !1097)
!1101 = !DILocation(line: 0, scope: !1097)
!1102 = distinct !DISubprogram(name: "__internal__.to_class_ptr", linkageName: "__internal__.to_class_ptr:0[Ptr[byte],std.internal.types.collections.dict.Dict.0[str,str]].581", scope: !332, file: !332, line: 463, type: !1103, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!1105, !239}
!1105 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1106)
!1106 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict.0[str,str].contents", scope: !256, file: !256, size: 448, elements: !1107)
!1107 = !{!1108, !1110, !1111, !1112, !1113, !1116, !1122}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1106, file: !1109, line: 12, baseType: !244, size: 64)
!1109 = !DIFile(filename: "dict.codon", directory: "/Users/rgt/.codon/lib/codon/stdlib/internal/types/collections")
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1106, file: !1109, line: 13, baseType: !244, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1106, file: !1109, line: 14, baseType: !244, size: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1106, file: !1109, line: 15, baseType: !244, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1106, file: !1109, line: 17, baseType: !1114, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DIBasicType(name: "UInt32", size: 32, encoding: DW_ATE_unsigned)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1106, file: !1109, line: 18, baseType: !1117, size: 64, offset: 320)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !1119)
!1119 = !{!1120, !1121}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1118, file: !9, line: 146, baseType: !244, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1118, file: !9, line: 146, baseType: !239, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1106, file: !1109, line: 19, baseType: !1117, size: 64, offset: 384)
!1123 = !DILocation(line: 463, column: 5, scope: !1102)
!1124 = distinct !DISubprogram(name: "__internal__.class_alloc", linkageName: "__internal__.class_alloc:0[,std.internal.types.collections.dict.Dict.0[str,str]].583", scope: !332, file: !332, line: 42, type: !1125, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1142)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!1127}
!1127 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1128)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict.0[str,str].contents", scope: !256, file: !256, size: 448, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1133, !1134, !1135, !1141}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1128, file: !1109, line: 12, baseType: !244, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1128, file: !1109, line: 13, baseType: !244, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1128, file: !1109, line: 14, baseType: !244, size: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1128, file: !1109, line: 15, baseType: !244, size: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1128, file: !1109, line: 17, baseType: !1114, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1128, file: !1109, line: 18, baseType: !1136, size: 64, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !1138)
!1138 = !{!1139, !1140}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1137, file: !9, line: 146, baseType: !244, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1137, file: !9, line: 146, baseType: !239, size: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1128, file: !1109, line: 19, baseType: !1136, size: 64, offset: 384)
!1142 = !{!1143, !1144}
!1143 = !DILocalVariable(name: "sz", scope: !1124, file: !332, line: 44, type: !244)
!1144 = !DILocalVariable(name: "obj", scope: !1124, file: !332, line: 45, type: !239)
!1145 = !DILocation(line: 42, column: 5, scope: !1124)
!1146 = !DILocation(line: 44, column: 9, scope: !1124)
!1147 = !DILocation(line: 45, column: 9, scope: !1124)
!1148 = !DILocation(line: 44, column: 14, scope: !1124)
!1149 = !DILocation(line: 45, column: 35, scope: !1124)
!1150 = !DILocation(line: 45, column: 28, scope: !1124)
!1151 = !DILocation(line: 45, column: 68, scope: !1124)
!1152 = !DILocation(line: 51, column: 32, scope: !1124)
!1153 = !DILocation(line: 52, column: 46, scope: !1124)
!1154 = distinct !DISubprogram(name: "__magic__.new", linkageName: "__magic__.new:0[,std.internal.types.collections.dict.Dict.0[str,str]].584", scope: !332, file: !332, line: 588, type: !1155, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!1157}
!1157 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1158)
!1158 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict.0[str,str].contents", scope: !256, file: !256, size: 448, elements: !1159)
!1159 = !{!1160, !1161, !1162, !1163, !1164, !1165, !1171}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1158, file: !1109, line: 12, baseType: !244, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1158, file: !1109, line: 13, baseType: !244, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1158, file: !1109, line: 14, baseType: !244, size: 64, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1158, file: !1109, line: 15, baseType: !244, size: 64, offset: 192)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1158, file: !1109, line: 17, baseType: !1114, size: 64, offset: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1158, file: !1109, line: 18, baseType: !1166, size: 64, offset: 320)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !9, file: !9, line: 146, size: 128, elements: !1168)
!1168 = !{!1169, !1170}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1167, file: !9, line: 146, baseType: !244, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1167, file: !9, line: 146, baseType: !239, size: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1158, file: !1109, line: 19, baseType: !1166, size: 64, offset: 384)
!1172 = !DILocation(line: 588, column: 5, scope: !1154)
!1173 = !DILocation(line: 590, column: 16, scope: !1154)
!1174 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict.0[str,str].__new__", linkageName: "std.internal.types.collections.dict.Dict.0[str,str]:std.internal.types.collections.dict.Dict.0.__new__:0.585", scope: !863, file: !863, line: 369, type: !1175, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!1177}
!1177 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1178)
